[{"id": 0, "username": "Tanish", "text": "To,\nName:  Tanish Saini \nImportant information following your successful completion of the interview process during the\ncampus visit\nDear  Tanish Saini \nThis communication conﬁrms that you have successfully completed the initial interview process.\nCongratulations! Your journey towards receiving an offer of employment from Accenture has now begun.\nPlease review this information to familiarize yourself with the various steps and actions involved in your\napplication process before Accenture issues an offer of employment.\nDocument Veriﬁcation Process -  After accepting this Letter of Intent, you will need to submit certain\nrequired documents. The issuance of your oﬀer will depend on the successful veriﬁcation of these\ndocuments. Once you receive the oﬀer, please ensure that you accept it within 7 days of receiving the\nOffer Letter.\nAt all stages of the hiring process, you are expected to declare all facts honestly and act with utmost\nintegrity while applying for any opportunity. In case of any misrepresentation of information/facts in your\ncandidate registration process or at any stage of the hiring process, this Letter of Intent or any\nsubsequent offer issued to you shall stand revoked.\nAccenture Learning Program - Accenture oﬀers an extensive pre-onboarding online learning program\ndesigned to provide new joiners with essential skills and tools for job readiness. We are sharing the\ndetails of this program in advance to help you understand its conditions and requirements."}, {"id": 1, "username": "Tanish", "text": "Please note\nthat some parts of the learning program may continue post onboarding.\nAssessments: Assessments will be conducted at various points throughout the program.\nScoring and Attempts: Assessment scores will contribute to the final score at the end of the\ntraining.\nA minimum aggregate score of 60% is required to successfully complete the program.\nIf you do not achieve a 60% score on your first attempt, you will have up to three additional\nattempts.\nWhile you will still be onboarded at Accenture as per the agreed schedule, please note that\nwhilst assessment completion is not a precondition to onboard still you will need to complete\nthe learnings/trainings within the attempts mentioned herein below, for a continued\nemployment in Accenture.\nDo note that some of these attempts may occur after you have onboarded Accenture.\nLearning completion:  You shall only get four attempts to complete the learning program (some\nattempts can be made pre-onboarding & balance post onboarding). If you do not successfully\ncomplete the learning program within the total four attempts (inclusive of pre onboarding & post\nonboarding attempts), your employment with the company will be terminated as per Clause 10 in the\nTerms of Employment.\nLearning Bonus - 100% completion of learning modules prior to onboarding and successful\ncompletion of the learning program assessments, as outlined above, will make you eligible for a\nlearning bonus of INR 30,000, which will be paid post onboarding in addition to the salary as per\nCompany pay cycle. The learning bonus as mentioned above is applicable only upon successful\ncompletion of assessments prior to onboarding.\nPlease note: Learning bonus amount, so paid to you, shall be considered as taxable income for all\npurposes. Applicable taxes will be deducted via payroll at the time of payment of learning bonus to\nyou."}, {"id": 2, "username": "Tanish", "text": "The Company reserve the right to amend, suspend, modify & withdraw the learning program &\nits associated benefits.\nDeployment - You will be assigned a base location that will be the basis & utilized for all oﬃcial and\nadministrative purposes including leaves etc. Considering the nature of our operations and basis\nbusiness needs you may need to relocate anywhere in India for project deployment and work in 24/7\nshifts based on business requirements.\nWe wish you the best of this journey and congratulate you on clearing the interviews. Your proposed\ncompensation for the ease of information and subject to release of an oﬀer of employment by Accenture\nis as mentioned in Annexure A. Specific details will be mentioned in your formal offer letter.\nAnnexure A\nCareer Level – 12\nProposed role – Packaged App Development Associate\nAnnual fixed compensation for the ﬁscal will be INR 3,83,000; this includes allowances structured\nin accordance with the Company compensation guidelines and applicable statutory norms.\nIndividual Performance Bonus (IPB) - At your career level, the maximum annual variable pay-out\nis estimated as INR 32,555; subject to the overall terms and conditions of the IPB, including but not\nlimited to your performance achievements and the Company’s performance.\nMaximum Annual Total earning potential - INR 4,15,555 /-\nAdditional Notional Beneﬁts: Gratuity for each year of service (indicative and assumed value\ncalculated at an approximation of 4.81% of annual basic) – INR 6,400 /- Notional Insurance Premium\npaid by Company – INR 13,700 /-\nAnnual Total earning potential + Additional Notional Benefits – INR 435,655 /-\nJoining Bonus - You are also eligible for a joining Bonus of INR 25,000; payable upon successful\ncompletion of initial training as per company process."}, {"id": 3, "username": "Tanish", "text": "The joining bonus is a one-time payment that\nwill be paid with the first month's salary.\nPlease note, the above is informative and not exhaustive, speciﬁc details will be in the Oﬀer\nLetter\n“This is an electronically generated document does not require signatures.”"}, {"id": 4, "username": "oscar", "text": "ABSTRACT\nThe Indian agricultural sector, a cornerstone of the nation's economy, grapples with\nchallenges such as population pressure, climate change, resource constraints, and the\nimperative for sustainable practices. This study explores the integration of artificial\nintelligence (AI) as a transformative solution to enhance productivity, sustainability, and\nfood security. Key AI applications include machine learning, data analytics, robotics,\nand remote sensing, impacting crop management, livestock monitoring, precision\nfarming, and supply chain optimization. Farmers are increasingly adopting AI-driven\nsolutions for informed decision-making, improved yields, reduced wastage, and\nstreamlined operations. The study delves into government policies, private-sector\ninitiatives, and socioeconomic impacts, addressing accessibility, affordability, and the\ndigital divide. This study focuses on limited productivity, climate uncertainty, resource\nscarcity, pest and disease management, and the lack of knowledge and training. The\nresearch majorly focuses on the three major states of India i.e., Uttar Pradesh, Haryana\n& Punjab and analysis of water quality of these states done through Anova and Linear\nRegression ML models, results used to assess the current state of the sector, exploring\nAI applications, evaluating economic and environmental impacts, analyzing feasibility\nand scalability, and providing policy recommendations for successful AI integration.\nKeywords\n-\nIndian\nagriculture,\nartificial\nintelligence,\nprecision\nfarming,\nsustainability, climate change, resource efficiency, water quality, socio economic\nimpact.\nLIST OF TABLES\n1. Literature review\n2. Application of Expert System in Indian Agriculture\n3. Application of Artificial Neural Networks in Indian Agriculture\n4. Government initiative and startups for deeper integration of AI in Agriculture\n5. Comparison table for farming with precision agriculture\n6. Agricultural Variables\n7. Actual water quality of last 3 years\n8. Recommended limits by ICAR and Ministry of Agriculture and Farmers Welfare\nLIST OF FIGURES\n1. Grape Pomace\n2. Coffee Silverskin\n3. Tea Waste\n4. DeHaat Startup\n5. How Sowing App helps the farmer\n6."}, {"id": 5, "username": "oscar", "text": "Components of machine based precision agriculture\n7. Tomato and Brinjal productivity comparison using precision and imprecision\nfarming\n8. ML Model Working\n9. Interpretation of Nitrate Levels\n10. Interpretation of Sulphate Levels\n11. Interpretation of Lead Levels\nChapter 1\nINTRODUCTION\n1.1\nOverview\nThe agricultural sector is the backbone of the Indian economy, employing a significant\nportion of the population and contributing substantially to the nation's GDP. However, it\nfaces numerous challenges, including increasing population pressure, climate change,\nresource constraints, and the need for sustainable agricultural practices. In this context,\nthe integration of artificial intelligence (AI) into the agricultural sector offers promising\nsolutions to enhance productivity, sustainability, and food security. This study aims to\nexplore the applications of AI in the Indian agricultural sector, addressing key\nchallenges and providing insights into its potential benefits. This study aims to delve\ninto the role of AI in the Indian agricultural sector, its applications, benefits, and\nchallenges. AI technologies encompass a wide range of tools, such as machine learning,\ndata analytics, robotics, and remote sensing, which can be harnessed to enhance various\naspects of agriculture, including crop management, livestock monitoring, precision\nfarming, and supply chain optimization.\nIn recent years, Indian farmers have started to embrace AI-driven solutions to make\nmore informed decisions, improve crop yields, reduce wastage, and streamline\noperations. These technologies help in real-time data collection and analysis, enabling\nfarmers to make precise and timely interventions. This study will explore key AI\ninitiatives in the Indian agricultural landscape, shedding light on government policies\nand private-sector endeavors that promote AI adoption. Additionally, it will analyze the\nsocioeconomic impact of AI on farmers, labor, and rural communities, addressing issues\nrelated to accessibility, affordability, and the digital divide."}, {"id": 6, "username": "oscar", "text": "This research aims to\nprovide insights into the evolving relationship between AI and Indian agriculture,\noffering valuable perspectives for policymakers, researchers, and stakeholders invested\nin the future of this vital sector.\nOver the past few decades, India's agricultural sector has witnessed significant\ntransformations, driven by a series of innovations and technologies. Historically, the\nGreen Revolution of the 1960s and 1970s marked a turning point, leading to increased\ncrop yields through the adoption of high-yielding varieties, irrigation, and modern\nfarming practices. Subsequently, the Indian government introduced schemes like the\n“National Agricultural Policy in 2000”, fostering a comprehensive approach to\nagricultural development. However, the present study focuses on the integration of\nArtificial Intelligence (AI) into Indian agriculture, which has shown great promise in\nenhancing productivity and sustainability. AI-powered machines and tools, such as\nautonomous tractors, drones for precision farming, and data-driven decision support\nsystems, have become increasingly prevalent. These technologies enable farmers to\nmake data-informed choices related to crop management, pest control, and resource\nallocation. The results are notable, with increased crop yields, reduced resource\nwastage, and enhanced income for farmers. Achievements in the field are visible\nthrough success stories of AI-adoption in states like Punjab, Haryana, and Maharashtra.\nAdditionally, references to government initiatives like the “National Mission on\nSustainable Agriculture (NMSA)” and the “Pradhan Mantri Fasal Bima Yojana\n(PMFBY)” demonstrate the government's commitment to modernizing the agricultural\nsector. The study thus serves as a testament to the evolving landscape of Indian\nagriculture and the potential of AI to further revolutionize the industry.\nAI-driven solutions, leveraging machine learning algorithms, remote sensing, and data\nanalytics, have empowered farmers to make data-driven decisions regarding planting,\nirrigation, and pest control."}, {"id": 7, "username": "oscar", "text": "Organizations like the “International Crops Research\nInstitute for the Semi-Arid Tropics (ICRISAT)” and startups like CropIn have been\nat the forefront of these advancements, developing AI tools that help farmers optimize\ncrop production and resource utilization. These innovations are not only increasing\nagricultural productivity but also reducing environmental impact, a critical concern for a\nsustainable future. As India continues to embrace AI in agriculture, it is poised to\naddress food security and contribute to global agricultural innovation.\n1.2\nArtificial Intelligence & its applications\nArtificial Intelligence (AI) is a branch of computer science focused on creating smart\nmachines that can perform tasks usually requiring human intelligence. These tasks\ninclude learning, reasoning, solving problems, perceiving, understanding language, and\nmaking decisions. AI technologies encompass various methodologies such as machine\nlearning,\nnatural\nlanguage\nprocessing,\ncomputer\nvision,\nand\nrobotics.\nThe\nimplementation of AI across various fields like healthcare, agriculture, education, and\nmanufacturing promises to transform processes and enhance efficiency.\nArtificial intelligence is significantly enhancing personalized learning. Advanced\ntutoring\nsystems\ncan\nadjust\nto each student's unique requirements, delivering\ncustomized content and feedback. Moreover, natural language processing enables the\ncreation of virtual assistants and chatbots that support students throughout their\neducational\nexperience.\nAI-powered\neducational\nplatforms\ncan\nassess\nstudent\nperformance data, pinpoint areas for improvement, and boost overall learning results\nVictor Mokaya (2019).\nArtificial intelligence is revolutionizing the healthcare industry by enhancing patient\ncare, diagnosis, and treatment. By leveraging machine learning, AI systems can process\nlarge volumes of medical data, such as patient records, diagnostic images, and genetic\ninformation, to uncover patterns and insights that might elude human practitioners."}, {"id": 8, "username": "oscar", "text": "This\ntechnology aids in the early detection of diseases, the creation of personalized treatment\nplans, and the development of new drugs, resulting in more precise and effective\nhealthcare services.\nArtificial intelligence is revolutionizing traditional farming through the use of precision\nagriculture. AI-driven systems analyze data from various sources such as sensors,\nsatellites, and drones to offer farmers critical insights into crop health, soil conditions,\nand weather trends. This enables more efficient resource usage, accurate irrigation, and\ntimely pest management, resulting in higher crop yields and more sustainable\nagricultural practices. In the manufacturing industry, AI is ushering in Industry 4.0 by\ntransforming production processes and supply chain management. Smart factories use\nAI to optimize production schedules, predict maintenance needs for equipment, and\nenhance\noverall\noperational\nefficiency.\nAdditionally,\nAI-powered\nrobotics\nand\nautomation are increasingly utilized in manufacturing to handle repetitive tasks,\nimprove accuracy, and boost production speeds.\nThe increasing use of AI brings forth ethical challenges such as data privacy,\nalgorithmic\nbias,\nand\nemployment\nimpacts.\nBalancing\ninnovation with ethical\nresponsibility is essential to the responsible implementation of AI technologies in\ndiverse fields.\n1.3\nObjectives\n• To assess the current water quality in the states of Uttar Pradesh, Haryana &\nPunjab and the economic and environmental impact of AI adoption in agriculture.\n• To provide policy recommendations and practical strategies for the successful\nintegration of AI into the Indian agricultural sector.\n1.4\nMotivation\nThe motivation for this study lies in the potential transformational impact of artificial\nintelligence on the agricultural sector in India. By addressing the identified problems\nand achieving the outlined objectives, this research aims to contribute to the sustainable\ndevelopment of Indian agriculture. The successful integration of AI can lead to\nincreased agricultural productivity, reduced environmental impact, and improved\nlivelihoods for millions of farmers."}, {"id": 9, "username": "oscar", "text": "Furthermore, it can enhance food security and help\nIndia meet the challenges of the health sector and changing climate. This study seeks to\nprovide\nvaluable\ninsights\nand\nrecommendations\nto\npolicymakers,\nagricultural\npractitioners, and researchers involved in the field of AI and agriculture, ultimately\nbenefiting the entire nation.\n1.5\nRole of AI in Agriculture Sector of India\nThe role of Artificial Intelligence (AI) in the agriculture sector of India is pivotal, as it\npresents a transformative potential for addressing the diverse challenges faced by\nfarmers across different regions of the country. AI technologies have applications that\ncan be customized to cater to the unique needs and crops specific to various regions of\nIndia, Prakash et al. (2013).\nNorth India (Wheat and Rice): The Indo-Gangetic Plains of North India predominantly\ncultivate wheat and rice. AI-driven precision farming techniques help in optimizing\nirrigation, fertilization, and pest control. These technologies can monitor soil moisture,\ncrop health, and weather conditions to make real-time recommendations, ensuring\nhigher yields and resource efficiency, report by The Economic Times (2023).\nPunjab and Haryana (Wheat and Paddy): These states are known for wheat and paddy\ncultivation. AI can be used for early disease detection, enabling timely intervention to\nprevent crop losses. Drones equipped with AI-driven cameras can monitor large fields\nand identify areas where crops may be under stress.\nAI algorithms predict pest outbreaks based on weather and environmental data, allowing\nfarmers to apply pesticides judiciously and reduce environmental impact. AI is also\nused for automated ginning and sorting of cotton, improving quality and reducing\nmanual labor for Cotton production in Gujarat and Maharashtra. In Maharashtra, known\nfor grapes and sugarcane, AI applications are used to optimize the supply chain,\nensuring the efficient transportation and storage of perishable crops."}, {"id": 10, "username": "oscar", "text": "This contrasts with\nthe logistics needs of states like Uttar Pradesh, where AI helps manage the distribution\nof potatoes and wheat.\nSoil health is a key factor in crop productivity. AI-based soil testing and analysis are\nemployed differently in states growing crops such as tea in Assam and pulses in\nMadhya\nPradesh.\nThese\ntools\nprovide\ncustomized\nrecommendations\nfor\nsoil\namendments, ensuring optimal conditions for crop growth.\n1.6\nUse of Agriculture By-Products in Health Sector\nAgricultural by-products can be used in various ways in the health sector to promote\nwell-being and address health-related challenges. Here are some examples of how\nagricultural by-products can be utilized in the health sector:\nCrop Residues: Crop residues, such as stalks and husks, can be processed to extract\nvaluable compounds. For example, rice bran, a by-product of rice milling, contains\ngamma-oryzanol and tocotrienols that have potential health benefits, including\ncholesterol reduction and antioxidant properties.\nWheat bran[24]: Wheat bran is a rich source of dietary fiber, which has been shown to\nhave a number of health benefits, such as reducing cholesterol levels, regulating blood\nsugar levels, and promoting digestive health. Wheat bran can also be used as a bulking\nagent in foods, which can help to increase satiety and reduce calorie intake.\nRice bran: Rice bran is a good source of antioxidants, including vitamin E, ferulic acid,\nand oryzanol. These antioxidants can help to protect cells from damage and may have a\nrole in reducing the risk of chronic diseases such as cancer and heart disease. Rice bran\noil is also a good source of phytosterols, which can help to lower cholesterol levels.\nSoybean hulls[21]: Soybean hulls are a good source of insoluble fiber, which can help to\npromote digestive health."}, {"id": 11, "username": "oscar", "text": "Soybean hulls can also be used as a bulking agent in foods.\nFruit peels: Fruit peels are a good source of antioxidants, such as flavonoids and\nphenolic acids. These antioxidants can help to protect cells from damage and may have\na role in reducing the risk of chronic diseases such as cancer and heart disease. Fruit\npeels can also be used as a source of natural flavors and colors in foods.\nGrape pomace[25]: Grape pomace is the solid residue that remains after grapes have been\npressed to make wine. Grape pomace is a good source of antioxidants, including\nresveratrol. Resveratrol has been shown to have a number of health benefits, such as\nreducing the risk of heart disease and cancer. Grape pomace can also be used as a source\nof dietary fiber.\nFig 1: Grape Pomace[25]\nCoffee silverskin[26]: Coffee silverskin is the thin layer of skin that is removed from\ncoffee beans during the roasting process. Coffee silverskin is a good source of\nantioxidants, including chlorogenic acid. Chlorogenic acid has been shown to have a\nnumber of health benefits, such as reducing the risk of type 2 diabetes and obesity.\nFig 2: Coffee Silverskin[26]\nTea waste[24]: Tea waste is the solid residue that remains after tea leaves have been\nbrewed. Tea waste is a good source of antioxidants, such as catechins. Catechins have\nbeen shown to have a number of health benefits, such as reducing the risk of heart\ndisease and cancer. Tea waste can also be used as a source of natural flavors and colors\nin foods.\nFig 3: Tea Waste[24]\nWhy India Lacks behind in implementing AI in the Agriculture sector?\nIndia is a major agricultural producer, with the sector employing over half of the\ncountry's workforce."}, {"id": 12, "username": "oscar", "text": "However, the adoption of AI technologies in Indian agriculture has\nbeen slow compared to other countries, Victor Mokaya (2019).\nLack of data: AI models are trained on large datasets, and the availability of relevant\nagricultural data in India is limited. This is due to a number of factors, such as the lack\nof standardized data collection methods, the reluctance of farmers to share their data,\nand the poor quality of existing data.\nInfrastructure challenges: The rollout of AI technologies in agriculture requires a robust\ntelecommunications infrastructure. However, many rural areas in India lack reliable\ninternet connectivity, which can hinder the adoption of AI-powered solutions.\nCost of technology: The cost of AI hardware and software can be prohibitive for\nsmallholder farmers, who make up the majority of farmers in India. Additionally, the\ncost of training farmers on how to use AI technologies can be a barrier to adoption.\nLack of awareness: Many farmers are unaware of the potential benefits of AI in\nagriculture. This is due to a lack of outreach and education programs on the topic.\nCultural barriers: There is a cultural barrier to the adoption of new technologies in some\nparts of India. This can be due to a lack of trust in new technologies or a preference for\ntraditional farming methods.\nDespite these challenges, there are a number of initiatives underway to promote the use\nof AI in Indian agriculture. The government has launched a number of programs to\nsupport the development of AI-powered agricultural solutions. Additionally, a number\nof startups are developing AI-based solutions for farmers.\nFor example, the Indian Institute of Technology Kharagpur has developed a mobile app\nthat uses AI to identify pests and diseases in crops."}, {"id": 13, "username": "oscar", "text": "The app can also provide farmers\nwith advice on how to manage pests and diseases.\nAnother example is the startup DeHaat[35], which has developed a platform that connects\nfarmers with agricultural experts. The platform uses AI to provide farmers with\npersonalized advice on crop selection, irrigation, and fertilization.\nFig 4: DeHaat Startup[35]\nThe adoption of AI in Indian agriculture is still in its early stages, but there is growing\npotential for AI to play a major role in transforming the sector."}, {"id": 14, "username": "oscar", "text": "As the challenges to\nadoption are addressed, AI is likely to become a more widely used tool for improving\nagricultural productivity and sustainability in India.\nLimited Productivity: Indian agriculture often faces issues related to low yields,\ninefficient\nresource\nmanagement,\nand\ninadequate\naccess\nto\nadvanced\nfarming\ntechniques, leading to lower productivity levels.\nClimate Uncertainty: Climate change has made Indian agriculture more vulnerable to\nunpredictable weather patterns, which can result in crop failures and income instability\nfor farmers.\nResource Scarcity: The availability of critical resources like water and arable land is\ndecreasing, making it imperative to optimize their use and enhance resource efficiency\nin farming.\nPest and Disease Management: Inefficient pest and disease control measures can lead\nto significant crop losses and financial strain on farmers.\nLack of Knowledge and Training: Many farmers lack access to modern agricultural\nknowledge and training, preventing them from adopting advanced technologies and\npractices.\nChapter 2\nLITERATURE REVIEW\nSNO.\nAUTHOR, YEAR, JOURNAL\nTITLE\nFINDINGS\n1.\n“Sheshadri Chatterjee, Emerald\nPublishing Limited, 2020”\n“AI strategy of India: policy\nframework,\nadoption\nchallenges and actions for\ngovernment”\nThe findings indicate\nthe\nneed\nfor\nenhancements\nin\nIndia's\n\"National\nStrategy for AI\" to\noffer comprehensive\nguidance for policy\nformulation, with a\nparticular\nfocus on\naddressing\nsecurity,\nprivacy,\nand\ngovernance\nissues.\nThe\nresearch\nunderscores\nthe\nsubstantial potential\nof\nAI\nin\norganizational\ndevelopment,\nadvocating\nfor\na\ncomprehensive\nAI\npolicy\nthat\nwould\nyield\nsubstantial\nbenefits\nfor\nIndian\nindustries."}, {"id": 15, "username": "oscar", "text": "The study\nhighlights the social\nimplications of an AI\npolicy,\nemphasizing\nits\nimpact\non\nhuman-device\ninteractions\nand\nsocietal\ncommunications.\nIn\nconclusion, the paper\npresents\na\nunique\nand holistic attempt\nto\nprovide\npolicymakers\nwith\nmeaningful\ninputs\nfor the development\nof a comprehensive\nAI policy in India.\n2.\n“Tanha Talaviya, Dhara Shah,\nNivedita Patel, Hiteshri Yagnik,\nManan\nShah,\nScienceDirect,\n2020”\n“Implementation of artificial\nintelligence\nin\nagriculture\nfor optimisation of irrigation\nand application of pesticides\nand herbicides”\nThe\nintegration\nof\nAI-based\ntechnologies\nhas\nsignificantly\nenhanced efficiency\nand\naddressed\nchallenges\nacross\nvarious\nindustries,\nincluding\nagriculture.\nIn\nthe\nagricultural\nsector,\nAI applications such\nas\ncrop\nyield\nmanagement,\nirrigation,\nsoil\ncontent sensing, crop\nmonitoring,\nweeding,\nand\ncrop\nestablishment play a\ncrucial\nrole.\nAgricultural\nrobots,\nleveraging AI, offer\nvaluable solutions to\nthe challenges faced\nby the sector."}, {"id": 16, "username": "oscar", "text": "As the\nglobal\npopulation\nrises, the agricultural\nindustry encounters a\ncrisis,\nbut\nAI\npresents a promising\nsolution.\nAI-based\ntechnological\nsolutions\nenable\nfarmers to increase\noutput\nwith\nfewer\nresources,\nimprove\noutput\nquality, and\nexpedite\nthe\ngo-to-market process\nfor\ncrops.\nProjections\nindicate\na substantial increase\nin the adoption of\nconnected devices by\nfarmers, reaching 75\nmillion\nby\n2020.\nFurthermore,\nby\n2050,\nan\naverage\nfarm is expected to\ngenerate 4.1 million\ndata\npoints\ndaily.\nAI's contributions to\nthe\nagricultural\nsector include image\nrecognition\nand\nperception,\nparticularly\nin\nthe\nuse of autonomous\nUnmanned\nAerial\nVehicles (UAVs) for\napplications such as\nsurveillance, human\nbody\ndetection,\ngeolocalization,\nsearch\nand\nrescue,\nand\nforest\nfire\ndetection, owing to\ntheir versatility and\nadvanced\nimaging\ntechnology.\n3.\n“N.\nN.\nMisra,\nYash\nDixit,\nAhmad\nAl-Mallahi,\nManreet\nSingh Bhullar, Rohit Upadhyay,\nAlex Martynenko, IEEE Internet\nof Things Journal ( Volume: 9,\nIssue: 9, 01 May 2022)”\n“IoT,\nBig\nData,\nand\nArtificial\nIntelligence\nin\nAgriculture\nand\nFood\nIndustry”\nThe\nInternet\nof\nThings\n(IoT)\nis\nidentified\nas\na\npivotal area in future\ntechnology,\ngarnering significant\nattention\nacross\nindustries.\nIn\nagriculture,\nthe\nimplementation\nof\nIoT\ninfrastructure\nenhances efficiency,\nintelligence,\nand\nconnectivity\nfor\nfarmers,\nproviding\nvaluable information\non crop yields, soil\nmapping,\nfertilizer\napplications, weather\ndata, machinery, and\nanimal\nhealth.\nSensor use is rising\nfor early detection of\ncrop\nhealth\nissues,\ncontributing\nto\npublic\nhealth\nand\nsafety. In the food\nsupply\nchain,\nIoT\nadoption\nfacilitates\nreal-time\ntracking\nand\nrerouting\nof\nconsignments, while\ntechnologies\nlike\nminiature\nspectral\ncameras, blockchain,\nand\ngenome\nsequencing\nare\nemployed\nfor food\nquality, authenticity,\nand traceability."}, {"id": 17, "username": "oscar", "text": "Big\ndata\nanalytics,\nespecially\nfrom\nsocial media, aids in\nunderstanding\nconsumer\nbehavior\nand\ncrowdsourcing\nideas for new food\nproducts.\nThe\npotential impacts of\nIoT\nand\nbig\ndata\ninclude\neconomic\nbenefits\n(increased\nproductivity,\nlower\nproduction\ncosts,\nhigher\nquality),\nenvironmental\nadvantages (resource\nefficiency,\nreduced\nemissions),\nand\nsocial improvements\n(enhanced\npublic\nhealth,\nconsumer-driven\ndemand,\nand\nimproved quality of\nlife).\nEmbracing\ntechnological\ninnovations is crucial\nfor\nthe success of\nmodern\nagriculture\nand\nthe\nfood\nindustry.\n4.\n“Rahul\nKatarya,\nAshutosh\nRaturi,\nAbhinav\nMehndiratta,\nAbhinav Thapper,\n2020 3rd\nInternational\nConference\non\nEmerging\nTechnologies\nin\nComputer Engineering: Machine\nLearning and Internet of Things\n(ICETCE)”\n“Impact\nof\nMachine\nLearning\nTechniques\nin\nPrecision Agriculture”\nAgriculture,\ncontributing\nto\napproximately\n17%\nof India's GDP and\nemploying\n70% of\nthe\npopulation,\nremains\na\nvital\nsector.\nHowever,\ntraditional\nand\nsomewhat\noutdated\nmethods\npersist\nin\ncrop cultivation, and\nIndian farmers face\nchallenges\nin\nselecting\nthe\nright\ncrops\nbased\non\nbiological\nand\nnon-biological\nfactors. To enhance\ncrop yields, various\nAI\ntechniques,\nparticularly\nthose\nwithin\nPrecision\nAgriculture and crop\nrecommender\nsystems, have been\nproposed\nglobally.\nThis paper provides\na summary of these\napproaches,\nincluding\nKNN,\nSimilarity-based\nModels,\nEnsemble-based\nModels, and Neural\nNetworks.\nThese\nalgorithms\nconsider\nexternal factors such\nas\nmeteorological\ndata\nand\ntemperature,\nalong\nwith soil profile and\ntexture,\nto\noffer\nrecommendations\nthat optimize yields\nwhile\nminimizing\nresource and capital\nusage."}, {"id": 18, "username": "oscar", "text": "The aim is to\nmodernize\nagricultural\npractices, leveraging\nAI\ntechniques\nto\nimprove\ndecision-making\nprocesses for farmers\nin India and around\nthe world.\n5.\n“Deepak Sinwar, Vijaypal Singh\nDhaka, Manoj Kumar Sharma &\nGeeta Rani Internet of Things\nand Analytics for Agriculture,\nVolume 2 2020”\n“AI-Based Yield Prediction\nand Smart Irrigation”\nThis\nchapter\nexplores\nvarious\ntechniques\nand\napplications\nof\nArtificial\nIntelligence (AI) in\nthe domains of yield\nprediction and smart\nirrigation.\nThe\ntimely and accurate\nprediction\nof\nirrigation\nrequirements\nand\ncrop yields is crucial\nfor\nthe\nwell-being\nand\nsatisfaction\nof\nfarmers.\nEarly\npredictions\nsignificantly\ncontribute\nto\nminimizing\nproduction costs and\nmaximizing\ncrop\nyields. Furthermore,\nprecise\nyield\npredictions\nare\nbeneficial\nfor\ngovernment\nplanning, influencing\nschemes,\ntransportation needs,\nprocurement\nstrategies,\nstorage\ninfrastructure,\nand\nunderstanding\nthe\neconomic landscape\nbefore\nfarmers sell\ntheir\ncrops\nin\nthe\nmarket."}, {"id": 19, "username": "oscar", "text": "The chapter\nreviews\nboth\npast\nbreakthroughs\nand\nemerging\nAI-based\ntechniques\nin\nprecision\nfarming,\nfocusing specifically\non yield prediction\nand smart irrigation.\nAI\nsystems\noffer\nvaluable insights into\ncrop\nyields\nat\nan\nearly stage, and their\nassociated\nsmart\nirrigation\nmanagement systems\ncontribute\nto\nthe\njudicious\nuse\nof\nessential\nresources\nsuch as water and\nenergy in agriculture.\nThis\nintegration of\nAI\ntechnologies\nholds\npromise\nfor\nimproving\nagricultural practices\nand\nresource\nefficiency, benefiting\nboth\nfarmers\nand\nbroader\neconomic\nplanning.\n6.\n“Giovanni\nMirabelli,\nVittorio\nSolina, Procedia Manufacturing\nVolume 42, 2020”\n“Blockchain and agricultural\nsupply\nchains traceability:\nresearch trends and future\nchallenges”\nBlockchain\ntechnology,\ninitially\nimplemented in the\nfinancial sector, has\nbecome a focal point\nof\nresearch,\nextending\nits\napplication\nto\nvarious\nsectors,\nincluding healthcare,\nsmart\ncities,\nsmart\ncontracts,\nenergy\nmarkets,\nand\nthe\ngovernment\nsector.\nThis\nstudy\nconcentrates on the\nagricultural\nsector,\nspecifically\naddressing\nfood\ntraceability\nissues,\nand aims to collect\nand\nanalyze\nthe\nprimary\ncontributions in the\nliterature.\nThe\nsuccess\nof\nblockchain\nin\nthis\ncontext is attributed\nto its properties of\nreliability,\ntransparency,\nand\nimmutability.\nWith\nthe\nincreasing\nconsumer\nconcern\nabout the quality of\nagricultural products\nand the detrimental\neffects of pesticides\nand\nfertilizers\non\nhuman\nhealth,\nthe\nneed for an effective\ntraceability system in\nagriculture\nis\nevident.\nThe\nstudy\nnotes\nthat\nwhile\nthere are numerous\nproposals\nin\nthe\nliterature,\nthe\nimplementation\nof\nblockchain\ntechnology\nin\nthe\nagricultural sector is\nstill\nin\nits\nearly\nstages.\nLimited\napplications\nhave\nbeen\nput\ninto\npractical\nuse,\nand\ndespite\nthe\npromising nature of\nblockchain,\nmore\nefforts are required\nfor\nits\nmaturation.\nThe\nresearch\nidentifies\ncurrent\ntrends and potential\nfuture\nchallenges,\nhighlighting\nthe\nactive\ninvolvement\nof\ncountries\nlike\nChina,\nthe\nUnited\nStates, and Italy in\nblockchain\nresearch\nrelated\nto\nagriculture.\n7.\n“Rayda Ben Ayed and Mohsen\nHanana,\nJournal\nof\nFood\nQuality, volume 2021”\n“Artificial\nIntelligence\nto\nImprove\nthe\nFood\nand\nAgriculture Sector”\nThe\nincreasing\nglobal\npopulation,\nexpected\nto\nreach\nover\n9\nbillion\nby\n2050,\nposes\na\nsubstantial challenge\nfor\nthe\nagri-food\nindustry,\nnecessitating a 70%\nincrease\nin\nagricultural and food\nproduction.\nIn\nthe\nface\nof\nresource\nscarcity,\nclimate\nchange,\nthe\nCOVID-19\npandemic,\nand\nchallenging\nsocioeconomic\nconditions,\nthe\nadoption\nof\ncomputational\ntools\nand\nforecasting\nstrategies\nbecomes\ncrucial.\nThis\nstudy\nunderscores\nthe\nsignificance\nof\nartificial intelligence\n(AI)\nand\nmachine\nlearning\n(ML)\nas\npredictive\nmultidisciplinary\napproaches\nto\nenhance the food and\nagriculture\nsector.\nWhile\nacknowledging their\npotential, the authors\nalso highlight certain\nlimitations\nthat\nstakeholders\nshould\nconsider.\nThe\nagriculture and food\nindustries, integral to\nhuman survival, face\nchallenges\nfrom\nclimate\nchange,\npopulation\ngrowth,\ntechnological\nadvancements,\nand\nresource constraints.\nDigital technologies,\nincluding\nautomation, sensors,\nremote satellite data,\nAI,\nand\nML,\nare\nidentified\nas\nessential\ntools\nfor\naddressing\nthese\nchallenges\nacross\ndifferent\nstages\nof\nthe\nagriculture\nsupply\nchain.\nThe\nstudy\ndemonstrates\nthe growing trend in\nadopting AI and ML\nalgorithms\nto\nenhance monitoring,\ntraceability,\nand\noverall efficiency in\nvarious\nclusters\nof\nthe\nagriculture\nsupply chain.\n8.\n“Ali Tarab Rizvi, Abid Haleem,\nShashi Bahl & Mohd Javaid\nSpringer\nNature\nSingapore\n,\n2021”\n“Artificial Intelligence (AI)\nand\nIts\nApplications\nin\nIndian\nManufacturing:\nA\nReview”\nThis paper explores\nthe\napplication\nof\nartificial intelligence\n(AI)\nin the global\nmanufacturing\nsector,\nwith\na\nspecific focus on the\nIndian\ncontext.\nRecognizing\nAI as\nan\ninnovative\ntechnology, the study\nemphasizes its role\nin\nsectors such as\nhealthcare,\neducation,\nsmart\ncities,\nand\nagriculture.\nThe\nconcept\nof\n'Smart\nFactories'\nand\n'Industry\n4.0'\nis\nhighlighted\nas\na\ndriver\nfor\nincorporating\nautomation\nand\nintelligent robots to\nenhance\nmanufacturing\nprocesses,\nimprove\nproduct quality, and\nboost\noverall\nproductivity.\nThe\nstudy\nunderscores\nAI's significance in\nfacilitating\nresearch\nand\ndevelopment,\nerror\nreduction,\ndemand forecasting,\nand\noutcome\nsimulation\nto\nenhance\ncompetitiveness."}, {"id": 20, "username": "oscar", "text": "The\nneed for an industry\nthat is adaptable to\ndisruptive\nchanges\nand\na\nworkforce\ncapable\nof\ncollaborative\nwork\nwith\ntechnology\nis\nemphasized.\nThe\nstudy,\nconducted\nthrough\nGoogle\nScholar,\nanalyzes\nrelevant articles and\njournals\nto\ndiscuss\nthe\ncurrent\nstatus,\nlimitations,\nand\nsuggested changes in\npolicies and working\nparameters\nwithin\nthe\nIndian\nmanufacturing sector\nin the context of AI\nadoption.\n9.\n“Showkat Ahmad Bhat, Nen-Fu\nHuang, IEEE Access ( Volume:\n9), 2021”\n“Big\nData\nand\nAI\nRevolution\nin\nPrecision\nAgriculture:\nSurvey\nand\nChallenges”\nThis article explores\nthe\napplication\nof\nInformation\nand\nCommunication\nTechnologies (ICT),\nparticularly\nBig\nData,\nin\nprecision\nagriculture\nfor\nsustainable\nagricultural\ndevelopment.\nBig\nData\ntechnologies,\nincluding\nmachine\nlearning\nand\ndeep\nlearning,\nplay\na\ncrucial\nrole\nin\nanalyzing\nvast\namounts\nof\nagricultural data to\nenhance\nproductivity,\nefficiency,\nand\nenvironmental\nsustainability.\nThe\nfocus\nis\non\nunderstanding\nthe\nlatest applications of\nBig Data in smart\nagriculture,\naddressing social and\neconomic\nchallenges.\nThe\narticle discusses data\ncreation\nmethods,\ntechnology\nand\ndevice\naccessibility,\nsoftware tools, and\ndata\nanalytics\nin\nprecision agriculture.\nIt\nhighlights\nthe\npotential of Big Data\nto\nimprove\ndecision-making\nin\nprecision\nfarming\nand\naddresses\nchallenges faced in\nits\nwidespread\nimplementation. The\narticle\nemphasizes\nthe\nrole\nof\ninnovative\nmachine\nlearning techniques,\nsuch\nas\nConvolutional\nNeural\nNetworks\n(CNN),\nin\nprocessing large and\ncomplex agricultural\ndatasets."}, {"id": 21, "username": "oscar", "text": "Challenges\nfaced by Big Data\nand AI in precision\nagriculture\nare\ncategorized, and the\nintegration\nof\nautomation,\nAI,\ndrones, IoT, robots,\nand\nBig\nData\nis\nanticipated\nto\ntransform\nvarious\nagriculture domains.\nThe\nadoption\nof\nhigh-performance,\ndata-driven learning\nmethods is expected\nto\nautomate\nagriculture processes\nand\nenhance\nreal-time\ndecision-making,\ncontributing\nto\nsustainability,\nefficiency,\nclimate\nchange\nadaptation,\nand\nfood\nsecurity.\nThe article concludes\nby highlighting the\nbenefits of AI and\nBig\nData, such as\ndeveloping healthier\nproducts, supporting\nprecision agriculture\ndecision-making,\nand preventing food\nwastage\nand\nfood-borne diseases.\nOverall,\nthe\ntransformative\npotential\nof\nthese\ntechnologies in the\nagriculture\nindustry\nis\nacknowledged,\nwith\na\nfocus\non\naddressing\ncurrent\nchallenges\nand\nrevolutionizing\nvarious\naspects\nof\nagriculture.\n10.\n“Vishal Meshram, Kailas Patil,\nVidula\nMeshram,\nDinesh\nHanchate,\nS.D.\nRamkteke,\nArtificial Intelligence in the Life\nSciences Volume 1, December\n2021”\n“Machine\nlearning\nin\nagriculture\ndomain:\nA\nstate-of-art survey”\nThis comprehensive\nsurvey explores the\ntransformative\nimpact\nof machine\nlearning\n(ML)\nand\ndeep\nlearning\nin\nagriculture,\nparticularly\nin\ndeveloping countries\nlike\nIndia.\nRecognizing\nagriculture as a vital\nsource\nof\nemployment\nand\neconomic backbone,\nthe study categorizes\nactivities\ninto\npre-harvesting,\nharvesting,\nand\npost-harvesting."}, {"id": 22, "username": "oscar", "text": "ML\nis\nidentified\nas\na\npowerful\ntool\nfor\nimproving\nfarming\nefficiency,\nreducing\nlosses,\nand\nenhancing\nproduction\nquality.\nThe paper discusses\nchallenges\nsuch\nas\ndataset\ncreation,\ntraining\ntime,\nand\nhardware\nsupport\nwhile\nhighlighting\nsolutions\nlike\ntransfer learning and\nthe\nintegration\nof\nIoT\nwith\nML\nfor\nreal-time\ndata\nutilization.\nNoteworthy\ntechnologies\nlike\nConvolutional\nNeural\nNetworks\n(CNNs)\nand\nSingle-Shot\nCNNs\n(YOLO)\nare\nacknowledged,\nand\nthe emerging trend\nof\nAutomated\nML\n(AutoML)\nis\nintroduced\nfor\nefficient\nmodel\ndevelopment.\nThe\nstudy emphasizes the\nimportance\nof\nresearchers\ncreating\nand sharing datasets,\nproviding a valuable\nresource\nfor\nthose\nworking\non\nML\napplications\nin\nagriculture.\n11.\n“Abbas Sharifi, Mohsen Ahmadi\n&\nAli\nAla\nEnvironmental\nScience and Pollution Research,\n2021”\n“The\nimpact\nof\nartificial\nintelligence and digital style\non\nindustry\nand\nenergy\npost-COVID-19 pandemic.”\nThis article explores\nthe\nmultifaceted\nimpact\nof\nthe\nCOVID-19\npandemic on various\nsectors, focusing on\nmedicine,\nindustry,\nand energy, with a\ndistinct emphasis on\nthe role of artificial\nintelligence (AI) and\ndigital\ntechnologies\nin\nmitigating\nthe\nvirus's\neffects.\nIt\nsuggests\nthat\ncountries,\nparticularly\nthose\nreliant\non\nnon-renewable\nenergy, should invest\nin\nrenewable\nenergies\nlike\nsolar\nand wind power to\nenhance resilience in\nthe face of similar\ncrises.\nThe\npaper\nhighlights\nthe\nchallenges faced by\nthe\nenergy\nsector\nduring the pandemic,\nincluding\nreduced\nfinancial flows and\nchanges in consumer\nbehavior,\nand\nadvocates\nfor\nAI\napplications\nto\nanticipate\nenergy\nconsumption.\nThe\narticle acknowledges\nthe threats posed by\nthe\ncrisis but also\nidentifies\nopportunities,\nsuch\nas\nthe\ngrowth\nof\nbusinesses\nin\nrenewable\nenergy\nand\nthe\nincreased\nadoption\nof\nclean\ntechnologies.\nIt\nstresses\nthe\nimportance\nof\na\ndigital\nlifestyle for\nsocietal\nwell-being\nand proposes future\nresearch\ndirections,\nincluding\nexploring\nnew\nAI\nprospects\nand\nsustainable\nenergy\noptions\nto\naddress\nfuture\nchallenges.\n12.\n“Sumangala\nN.,\nShashidhar\nKini,\n(2022),\nInternational\nJournal\nof\nCase\nStudies\nin\nBusiness,\nIT\nand\nEducation\n(IJCSBE)”\n“Impact\nof\nAdopting\nMachine Learning Methods\non\nIndian\nAgriculture\nIndustry- A Case Study”\nThis paper explores\nthe\napplication\nof\nmachine learning in\nthe\ncontext\nof\nsustainable\nagriculture,\nspecifically focusing\non its impact on the\nagriculture sector in\nIndia.\nThe\nstudy\nutilizes\nsecondary\nresources\nsuch\nas\nscholarly\npublications,\nresearch\narticles,\nweb\nreports,\nand\ngovernment websites\nto gather data on the\nadoption of machine\nlearning solutions in\nIndian\nagriculture.\nEmploying\na\nqualitative\nresearch\nmethod,\nthe\npaper\nidentifies\nstrengths,\nweaknesses,\nopportunities,\nand\nchallenges\nin\nthe\nintegration\nof\nmachine learning in\nagriculture,\nparticularly\nemphasizing\nknowledge-based\npractices to enhance\nproductivity.\nThe\nfindings\nhighlight\nthe\npotential\nof\npredictive\nanalytics\nthrough\nmachine\nlearning\nto\nsignificantly advance\nagricultural\nproduction in India.\nThe\nresearch\nis\nlimited\nto\nfarming\npractices\nand\nemphasizes\nthe\ncontribution\nof\nmachine learning to\noverall\nproductivity\nand the growth of the\nIndian\nagricultural\nsector.\nThe\npaper\nunderscores\nthe\noriginality and value\nof\nincorporating\ndata-driven\napproaches\nthrough\nmachine\nlearning\nalgorithms to support\nthe development of\nsustainable\nagriculture in India.\n13.\n“Kirti\nNayal,\nRakesh\nRaut,\nPragati\nPriyadarshinee,\nBalkrishna\nEknath\nNarkhede,\nYigit\nKazancoglu,\nVaibhav\nNarwane,\nThe\nInternational\nJournal\nof\nLogistics\nManagement, 2022”\n“Exploring\nthe\nrole\nof\nartificial\nintelligence\nin\nmanaging\nagricultural\nsupply chain risk to counter\nthe\nimpacts\nof\nthe\nCOVID-19 pandemic”\nThis\narticle\naddresses the nascent\nstage\nof\nartificial\nintelligence\n(AI)\nadoption\nin supply\nchain\nmanagement\n(SCM) in India and\ninvestigates\nthe\nfactors\ninfluencing\nthis adoption along\nwith AI's impact on\nsupply\nchain\nrisk\nmitigation (SCRM).\nUtilizing\nthe\ntechnology,\norganization,\nand\nenvironment\n(TOE)\nframework,\nalongside\nsupply\nchain\nintegration\n(SCI),\ninformation\nsharing\n(IS),\nand\nprocess factors (PF),\nthe\nstudy collected\ndata\nfrom\n297\nrespondents\nin\nIndian\nagro-industries.\nStructural\nequation\nmodeling (SEM) was\nemployed\nto\ntest\nhypotheses.\nThe\nfindings reveal that\nprocess\nfactors,\ninformation sharing,\nand\nsupply\nchain\nintegration\nsignificantly\ninfluence\nAI\nadoption,\nand\nAI\npositively\ncontributes\nto\nSCRM."}, {"id": 23, "username": "oscar", "text": "Interestingly,\ntechnological,\norganizational,\nand\nenvironmental\nfactors\nexhibit\na\nnonsignificant\nnegative\nrelation\nwith\nAI\nadoption.\nThe\nstudy's\noriginality\nlies\nin\nproviding\nvaluable\ninsights\nfor\nresearchers,\npolicymakers,\nand\nindustry\npractitioners,\nemphasizing the role\nof\nAI\nadoption in\nmitigating\nsupply\nchain\nrisks\nexacerbated\nby\ndisruptions such as\nthe\nCOVID-19\npandemic.\n14.\n“Ashutosh\nSharma,\nMikhail\nGeorgi,\nMaxim\nTregubenko,\nAlexey\nTselykh,\nAlexander\nTselykh, Computers & Industrial\nEngineering Volume 165, March\n2022”\n“Enabling smart agriculture\nby\nimplementing artificial\nintelligence and embedded\nsensing”\nThis work addresses\nthe\nincreasing\ndemand\nfor\nsmart\nagriculture\nby\nfocusing\non\ncrop\nestimation\nand\nprediction,\nspecifically\nevaluating\nthe\nnitrogen\nstatus\nin\nwheat\ncrops.\nThe\nanalysis\ninvolves\ncomputational\nintelligence\ntechniques applied to\ncrop images captured\nunder\nvarying\nlighting\nconditions.\nThe\nproposed\napproach\nutilizes a\ncombination\nof\nArtificial\nNeural\nNetwork (ANN) and\nGenetic\nAlgorithm\n(GA) for predicting\ncrop\nyield\nand\nclassifying precision\nstatus.\nHSI\ncolor\nnormalization\nis\nemployed on wheat\ncrop images, and the\noptimized\nprocess\ninvolves\nGA\nand\nANN-based\nprediction.\nThe\noutcomes\ndemonstrate that the\nANN\n+\nGA\nmechanism\nyields\nimproved\nperformance with a\nvalidation\naccuracy\nof\n97.75%,\na\nminimized error rate\nof 0.22, and reduced\nloss\nvalue.\nThe\nmethodology\nprovides\na\nsignificant\ncontribution to smart\nfarming technology,\nenhancing crop yield\nprediction\naccuracy\nand\nreducing\nerror\nrates\ncompared\nto\ncontemporary\ncounterparts.\nThe\narticle\nemphasizes\nthe\nimportance\nof\ncomputational\nintelligence in smart\nagriculture\nand\nproposes an effective\nsolution\nfor\ncrop\nyield prediction.\n15.\n“Kailash\nChand\nKumawat,\nBarkha Sharma, Sharon Nagpal,\nAjay\nKumar,\nShalini\nTiwari,\nRamakrishnan Madhavan Nair,\nFrontiers in Plant Science, 2022”\n“Scope and Recent Trends\nof Artificial Intelligence in\nIndian Agriculture”\nAgriculture,\nconstituting\na\nsignificant portion of\nIndia's\neconomy,\nfaces challenges in\nmeeting the growing\ndemand for food and\nemployment.\nTo\naddress these issues,\nthere\nis\na\nshift\ntoward automation in\nagriculture,\nand\nArtificial\nIntelligence\n(AI)\nemerges\nas\na\npromising\ntechnology.\nAI,\ninvolving the use of\nlearning\nalgorithms\nto create intelligent\nmachines, is crucial\nfor\nenhancing\nproductivity,\nefficiency,\nand\nthe\nincome of farmers.\nThis chapter delves\ninto the role of AI in\npromoting\nsocioeconomic\nand\nenvironmental\nsustainability in the\nIndian\nagricultural\nsector."}, {"id": 24, "username": "oscar", "text": "It specifically\nfocuses\non\nthe\nadoption\nof\nAI\npractices\nby\nsmall\nand\nmedium-sized\nfarmers\nin\nIndia,\nemphasizing\nthe\npotential\nof\nAI to\nrevolutionize\ntraditional\nfarming\nmethods\nand\ncontribute\nto\nthe\nsector's\noverall\nadvancement.\n16.\n“Sana\nRafi,\nRaghupathi\nBalasani, Faizan Qadir, Mary\nTahir, Faizan Ahmed & Wani\nSuhail\nAhmad\nTowards\nSustainable Natural Resources ,\n2022”\n“Role\nof\nArtificial\nIntelligence in Agriculture\nSustainability, an Example\nfrom India”\nThe\nagricultural\nsector, particularly in\ndeveloping\nagrarian\neconomies,\nfaces\nchallenges due to a\nlack\nof\nknowledge\nand decision support,\nhindering\nincreased\nproduction. Over the\npast few decades, the\napplication\nof\nArtificial\nIntelligence (AI) in\nagriculture\nhas\nevolved as a solution\nto these challenges.\nAI offers a dynamic\napproach to address\nthe\ncomplexities\ninherent\nin\nagriculture,\ncapturing\nthe\nintricate details of a\ncomplex\nsystem.\nThis\nstudy focuses\non exploring existing\nAI\ntechnologies\nin\nagriculture\nand\nrelated fields, with a\nspecific emphasis on\nIndia. By examining\nrecent\nresearch\nconducted over the\nlast five years, the\nstudy\naims\nto\nidentify effective AI\npractices\nthat\ncan\nassist growers at the\nfield\nlevel\nin\nincreasing\nproduction\nand\nimproving\nquality.\nThe findings indicate\na rapid growth in the\ndevelopment of AI\napplications\nin\nagriculture,\ncontributing\nto\nthe\nachievement\nof\nsustainable\ndevelopment\ngoals\nrelated\nto\nhunger\neradication\nand\nindustry innovation.\n17.\n“C.\nGaneshkumar,\nArokiaraj\nDavid,\nD.\nRaja\nJebasingh,\nAgri-Food 4.0 (Advanced Series\nin Management, Vol. 27), 2022”\n“Digital\nTransformation:\nArtificial Intelligence Based\nProduct\nBenefits\nand\nProblems\nof\nAgritech\nIndustry”\nThe\nprimary\nobjective\nof\nthis\nresearch\nis\nto\nexamine the benefits\nand\nchallenges\nassociated\nwith\nartificial intelligence\n(AI) in the agritech\nindustry. The study\nidentified\nvariables\nbased on a review of\nexisting\nliterature\nrelated to AI benefits\nand challenges."}, {"id": 25, "username": "oscar", "text": "Data\nwere collected from\n90 managers in the\nagritech\nindustry\nthrough a structured\nresearch\nquestionnaire.\nThe\nstatistical\npackage\nIBM-SPSS 21 was\nemployed\nfor\ndata\nanalysis,\nutilizing\nboth descriptive and\ninferential statistical\ntechniques.\nThe\nfindings indicate that\nthe\ntop-ranked\nAI\nbenefit\nis\nthe\nprovision\nof\nbetter\ninformation\nfor\nfaster\ndecision-making.\nThis\nsuggests\nthat\nagritech\nindustry\nexecutives prioritize\nthe quality of their\ndecision-making\nprocesses.\nOn\nthe\nother\nhand,\nresistance to change\nfrom employees and\ninternal\nculture\nemerged as the most\nprominent AI-related\nproblem\nfaced\nby\nagritech units.\n18.\n“Sharma,\nS.,\nVerma,\nK.,\n&\nHardaha,\nP.\n(2022).\nImplementation\nof\nArtificial\nIntelligence\nin\nAgriculture.\nJournal of Computational and\nCognitive Engineering”\n“Implementation\nof\nArtificial\nIntelligence\nin\nAgriculture”\nThe\nincreasing\nglobal\npopulation\nand growing demand\nfor food have driven\nthe\nadoption\nof\nagricultural\nautomation,\na\ntransformative\nphenomenon\npropelled\nby\nartificial intelligence\n(AI).\nTraditional\nfarming\nmethods\nproved\ninsufficient\nto\nmeet\nescalating\ndemands, prompting\nthe development of\nautomated\ntechniques that not\nonly\nfulfill\nfood\nrequirements\nbut\nalso\ngenerate\nemployment\nopportunities.\nAI\napplications\nin\nagriculture, such as\nrobotic\nweeding,\nirrigation,\nand\nspraying\nusing\nsensors in robots and\ndrones,\naddress\nchallenges\nlike\nweather\nvariability,\npopulation\ngrowth,\nand labor shortages.\nThese\ntechnologies\noptimize\nresource\nusage,\nreducing\nwater, pesticide, and\nherbicide\nconsumption,\npreserving\nsoil\nfertility,\nand\nenhancing\nlabor\nefficiency\nfor\nincreased\nagricultural\noutput\nand\nquality.\nThis\npaper\nprovides\nan\noverview\nof\nthe\ncurrent\nstate\nof\nautomation\nin\nagriculture, focusing\non robotic weeding\nsystems, soil water\nsensing technologies,\nand\nthe\ndiverse\napplications\nof\ndrones in spraying,\nmonitoring, and crop\nmanagement.\nThe\ndiscussion\nemphasizes\nthe\nintegration\nof\nAI\nwith\nother\ntechnologies\nto\naddress\nfarming\nchallenges\neffectively.\n19.\n“C."}, {"id": 26, "username": "oscar", "text": "Ganeshkumar, Sanjay Kumar\nJena,\nA.\nSivakumar,\nT.\nNambirajan\nJournal\nof\nAgribusiness in Developing and\nEmerging Economies 2023”\n“Artificial\nintelligence\nin\nagricultural\nvalue\nchain:\nreview\nand\nfuture\ndirections”\nThis paper presents a\ncomprehensive\nliterature review on\nthe\nutilization\nof\nartificial intelligence\n(AI) across various\nactors\nwithin\nthe\nagricultural\nvalue\nchain\n(AVC).\nThe\nauthors\nsystematically\ngathered\nliterature\nspanning\n25\nyears\n(1994–2020)\nfrom\nmultiple\ndatabases,\nclassifying it based\non\nthe\ndifferent\nstages of the AVC.\nThe\nanalysis,\nconducted\nusing\nNvivo 12 qualitative\nsoftware,\nrevealed\nthat\n50%\nof\nthe\nreviewed\nstudies\nwere empirical, and\n35%\nwere\nconceptual.\nThe\nfindings highlighted\nthat AI adoption in\nthe\nAVC\nhas\nthe\npotential to increase\nagricultural income,\nenhance\ncompetitiveness, and\nreduce\ncosts.\nInterestingly,\nthere\nwas a significant gap\nin\nAI\nresearch\nrelated\nto\nagricultural\nprocessing\nand the\nconsumer\nsector\ncompared to input,\nproduction,\nand\nquality\ntesting\nstages."}, {"id": 27, "username": "oscar", "text": "Notably, deep\nlearning algorithms,\nparticularly artificial\nneural\nnetworks,\nwere\nwidely\nemployed\nby\nAVC\nactors for tasks such\nas\nwater\nresource\nmanagement,\nyield\nprediction,\nprice/demand\nforecasting,\nenergy\nefficiency,\noptimization\nof\nfertilizer/pesticide\nusage, crop planning,\npersonalized\nadvisement,\nand\npredicting consumer\nbehavior.\nThis\nliterature review fills\na significant gap by\nproviding a holistic\nperspective\non\nAI\nuse\nthroughout the\nentire\nagricultural\nvalue chain.\n20.\n“Debesh\nMishra,\nKamalakanta\nMuduli, Rakesh Rau, Balkrishna\nEknath\nNarkhede,\nHimanshu\nShee,\nSujoy\nKumar\nJana,\nArtificial Intelligence and Big\nData\nAnalytics\nfor\nenhanced\nBusiness\nOperations:\nA\nContemporary\nResearch\nFramework\nand\nModelling,\n2023”\n“Challenges\nFacing\nArtificial\nIntelligence\nAdoption during COVID-19\nPandemic: An Investigation\ninto\nthe\nAgriculture\nand\nAgri-Food Supply Chain in\nIndia”\nThis study explores\nthe application and\nchallenges\nof\nArtificial\nIntelligence (AI) in\nthe agri-food supply\nchain, particularly in\nthe\ncontext of the\nCOVID-19\npandemic\nin India.\nDrawing on a survey\nof\n543\nfarmers in\nOdisha, the research\nemploys Interpretive\nStructural Modeling\n(ISM),\nMICMAC,\nand\nStep-Wise\nAssessment\nand\nRatio\nAnalysis\n(SWARA) to analyze\nthe data. Challenges\nidentified\ninclude\nresponse\ntime\nand\naccuracy,\nlack\nof\nstandardization,\nbig\ndata\nsupport,\nimplementation\ncosts,\nflexibility,\ncontextual\nawareness,\njob\nlosses, affordability,\ninfrastructure\nshortage, and farmer\nunwillingness.\nThe\nstudy emphasizes the\npotential benefits of\nAI\nin\nmitigating\nfarming\nchallenges\nand\nimproving\nthe\nagri-food\nsupply\nchain. The findings\npropose implications\nfor\nfarmers\nand\npolicymakers,\nunderlining the need\nfor\nimproved\ninfrastructure,\ntraining,\nand\nsupportive\npolicies\nto\nfacilitate\nAI\nadoption\nin\nagriculture.\nThe\nstudy concludes that\nwhile\nchallenges\nexist,\nAI\ntechnologies\noffer\ninnovative solutions\nfor\nenhancing\nefficiency\nand\nproductivity\nin\nthe\nagricultural\nsector\nand agri-food supply\nchain.\n21.\n“Upendra\nR.S.1,\nAhmed\nMohammed Riyaz1, Kumar T.\nNitesh2, Prithviraj S.R.2, Khan\nA."}, {"id": 28, "username": "oscar", "text": "Shahid2, Indian Journal of\nAgricultural\nResearch\nYear\n:\n2023, Volume : 57”\n“Indian\nagricultural sector\npresent and post pandemic\ncondition”\nThe\nCOVID-19\npandemic\nhas\nsignificantly\nimpacted\nthe\nagriculture and food\nsectors\nglobally,\ncreating\nchallenges\nfor small industries\nand\nfarmers.\nThis\narticle focuses on the\ninfluence\nof\nthe\npandemic\non\nagriculture,\nparticularly in India,\nwhere the lockdown\ndisrupted the supply\nchain\nduring\nthe\nharvest stage of Rabi\ncrops.\nDespite\nregistering moderate\ngrowth in yield, the\nbreakdown\nin\nthe\nsupply chain had a\nnoticeable impact on\nmarketability.\nThe\narticle\nemphasizes\nthe\nneed\nfor\nthe\nagriculture sector to\nembrace\nnew\ntechnologies,\ntransitioning\nfrom\nconventional\npractices\nto\nsmart\nagriculture.\nThe\nauthors advocate for\nthe\nadoption\nof\nInformation\nand\nCommunication\nTechnologies (ICTs)\nin\nagriculture,\nincluding automated\nmachinery, Artificial\nIntelligence\n(AI),\nInternet\nof\nThings\n(IoT), and Wireless\nSensor\nNetworks.\nThese ICT methods\ncan facilitate better\ndecision-making\nin\ncrop\ncultivation,\nenhance yields, and\nprovide resilience to\nthe challenges posed\nby\nthe\npandemic.\nThe\nreview\nunderscores\nthe\nimportance of smart\nagriculture practices\nin\nmaking\nthe\nagriculture\nsector\nmore profitable and\nresilient in the face\nof global crises.\n22.\n“Tarun Kumar Vashishth, Vikas\nSharma,\nSachin\nChaudhary,\nRajneesh\nPanwar,\nShashank\nSharma,\nPrashant\nKumar,\nHandbook\nof\nResearch\non\n“Advanced\nTechnologies\nand\nAI-Enabled\nIoT\nApplications in High-Tech\nAgriculture”\nThe chapter explores\nadvanced\ntechnologies\nand\nAI-enabled\nIoT\napplications\nin\nAI-Equipped IoT Applications in\nHigh-Tech Agriculture, 2024”\nhigh-tech\nagriculture,\naddressing\nchallenges\nin\ntraditional\nfarming\npractices.\nIt\nexamines\ntheir\nimpact\non\nsoil\nhealth,\npest\nand\ndisease management,\ncrop monitoring, and\nirrigation\nsystem\noptimization.\nThe\napproach\nintegrates\nIoT-enabled\nsensors\nto\ncollect\ndata\non\ncrop\ngrowth,\nsoil\nmoisture,\nand\nweather\nconditions,\nanalyzed\nusing\nmachine\nlearning\nalgorithms."}, {"id": 29, "username": "oscar", "text": "The goal\nis to provide insights\nand\nrecommendations to\nfarmers\nfor\noptimizing\nyields,\nreducing\nwater\nusage,\nand\nminimizing chemical\nuse.\nTraditional\nfarming\nfaces\nsustainability\nchallenges\ndue\nto\npopulation\ngrowth,\nclimate change, and\nresource constraints.\nThe novel approach\ncombines\nAI,\nIoT,\nand\nprecision\nagriculture\nto\nrevolutionize\nfarming.\nBy\nincorporating\nsensors,\ndrones,\nrobotics,\nand\nmachine\nlearning,\nfarmers\ngain\nreal-time\ndata\nfor\ninformed\ndecision-making.\nThis\ncan\nlead\nto\nhigher\nyields,\nimproved\ncrop\nquality,\nand\nenhanced\nprofitability,\ntransforming\ntraditional\nfarming\npractices\nand\ncontributing\nto\nsustainable\nagriculture.\nThe\nchapter\nalso\nemphasizes\nthe\nimportance\nof\nsustainable\nagriculture for food\nsecurity,\neconomic\ndevelopment,\nand\nenvironmental\nconservation.\n23.\n“Ray Chaudhary, R., Jain, S., &\nGupta,\nS.\n(2023).\nA\ncritical\nreview on hybrid framework for\nprecise farming with application\nof Machine Learning (ML) and\nInternet of Things (IoT)."}, {"id": 30, "username": "oscar", "text": "Journal\nof\nIntegrated\nScience\nand\nTechnology, 12(2)”\n“A critical review on hybrid\nframework\nfor\nprecise\nfarming with application of\nMachine Learning (ML) and\nInternet of Things (IoT)”\nPrecision\nfarming,\nalso\nknown\nas\nsite-specific\ncrop\nmanagement,\nhas\nbeen transformed by\nthe\nintegration\nof\ntechnology,\nparticularly machine\nlearning\n(ML)\nand\nthe\nInternet\nof\nThings\n(IoT).\nThis\nreview paper focuses\non the development\nand\nimplementation\nof a hybrid IoT and\nML\nsystem\nfor\nprecision\nfarming.\nWith real-time data\non crop growth, soil\nquality, and weather\npatterns,\nML\nalgorithms\nprocess\nvast\namounts\nof\ninformation\nto\nprovide farmers with\nvaluable insights for\ndecision-making.\nIoT devices collect\ndata\nfrom\nvarious\nsources, transmitting\nit to a central system\nfor\nanalysis.\nThe\nhybrid\nframework\ncombines\nmultiple\ntechnologies\nto\ncreate a cohesive and\neffective system for\nprecision\nfarming.\nThis\nintegration of\nML and IoT allows\nfor reduced pesticide\nand\nfertilizer\nuse,\nincreased\ncrop\nyields,\nand\noptimized\nwater\nusage.\nThe\nframework's\nadaptability\nand\nscalability\nmake\nit\nsuitable\nfor\nlarge-scale\nfarming\noperations.\nIn\nconclusion,\nthe\nhybrid\nframework\nfor precision farming\nusing ML and IoT\nshows\npromise\nin\nenhancing\nfarmers'\nproductivity\nand\nefficiency\nwhile\nminimizing\nenvironmental\nimpact.\nFurther\nresearch is needed to\nassess\nits\neffectiveness\nand\naddress\nany\nimplementation\nchallenges.\n24.\n“Samar\nFatima,\nKevin\nC.\nDesouza, Gregory S."}, {"id": 31, "username": "oscar", "text": "Dawson,\nEconomic Analysis and Policy\nVolume 67, September 2020”\n“National strategic artificial\nintelligence\nplans:\nA\nmulti-dimensional analysis”\nThe\nanalysis\nconducted\nreveals\nthat\nstrategic\nAI\nplans\nprovide\nvaluable insights into\nhow nations perceive\nopportunities\nfor\nmodernizing\nthe\npublic\nsector,\ntransforming\nindustries, managing\ncritical\ndata\nand\nalgorithmic\nelements,\nand\nplanning for capacity\nbuilding\nand\ngovernance\nframeworks\nto\nsupport\nAI\ndevelopment.\nNotably,\nChina's\nstrategic\nAI\nplan\nstands out for having\nthe largest coverage\nof the public sector.\nThe\nconclusions\ndrawn\nfrom\nthis\nexploratory\nwork\nemphasize\nits\npreliminary\nnature\nand acknowledge the\nneed\nfor\nfuture\nresearch\nto\ndelve\ndeeper\ninto\nthe\ncomponents of these\nplans.\nSubsequent\nstudies should aim to\nrigorously assess the\ndepth\nof\ncoverage\nand\nthe\nextent\nto\nwhich\ncritical\nconcepts\nare\naddressed\nin\neach\nplan, contributing to\na\nmore\ncomprehensive\nunderstanding\nof\nhow\nnations\nstrategize\ntheir\nfutures in the context\nof AI advancements.\n25.\n“A.\nSubeesh,\nC.R.\nMehta,\nArtificial\nIntelligence\nin\nAgriculture Volume 5, 2021”\n“Automation\nand\ndigitization\nof\nagriculture\nusing artificial intelligence\nand internet of things”\nThis paper reviews\nthe\napplication\nof\nInternet\nof\nThings\n(IoT) and Artificial\nIntelligence (AI) in\nmodern\nagriculture,\nhighlighting\ntheir\nrole\nin\nautomating\nand\nenhancing\nfarming\nactivities.\nThe\nstudy\nemphasizes\nthe\nsignificance\nof\ndigitization\nand\nautomation\nin\naddressing\nthe\nchallenges posed by\na growing population\nand climate change\nin\nthe\nagriculture\nsector. IoT and AI\nare\nacknowledged\nfor\ntheir\ncontributions\nto\nvarious\naspects\nof\nfarming,\nincluding\nsmart\nfarm\nmachinery, irrigation\nsystems,\npest\ncontrol,\nfertilizer\napplication,\ngreenhouse\nmanagement,\nand\nstorage systems. The\npaper discusses the\nimportance\nof data\ngenerated by sensors\nand the utilization of\nmachine\nlearning\nand\ndeep\nlearning\napproaches\nfor\nanalysis. It also notes\nthe\ntransformative\nimpact of AI and IoT\non\nagriculture,\nmaking\nfarming\npractices\nmore\nefficient."}, {"id": 32, "username": "oscar", "text": "Challenges\nrelated\nto\nsecurity\nare highlighted, and\nthe paper concludes\nthat the adoption of\ndigitization\nin\nagriculture\nis\ninevitable as IoT and\nAI-enabled products\nbecome\nmore\ncost-effective\nand\nrobust.\nThe\ncomprehensive\nreview aims to guide\nresearchers,\nagriculture\nentrepreneurs,\nand\nstakeholders\nin\nselecting\nthe\nbest\nmodels\nand\ntechniques\nfor\nspecific tasks in the\nfield.\nAgriculture is a cornerstone of the Indian economy, and the integration of Artificial\nIntelligence (AI) in the agricultural sector has been a subject of considerable research and\ndevelopment over the past few years. Earlier studies in this domain have focused on\noptimizing crop yields, resource management, and pest control through AI-driven\nsolutions. Initiatives like the \"National Mission on Agricultural Extension and\nTechnology\" (NMAET) have sought to leverage AI for the benefit of Indian farmers\n(NABARD, 2020). Moreover, precision agriculture and data-driven decision-making have\nseen substantial growth with the proliferation of AI technologies, contributing to improved\nproductivity and sustainability (Dwivedi et al., 2020). Past studies have laid the foundation\nfor AI in agriculture in India. Notable works by authors like Rathore et al. (2018)\nhighlighted the use of machine learning algorithms for crop yield prediction, while Pandey\net al. (2018) explored the potential of AI for pest and disease management. Further\nresearch by Kumar et al. (2019) emphasized the role of AI in precision agriculture,\nfacilitating efficient resource utilization. These past efforts have led to remarkable\nachievements. The development of AI-based applications such as CropIn, a startup\nfounded by Krishna Kumar, has played a pivotal role in the digitization of Indian\nagriculture."}, {"id": 33, "username": "oscar", "text": "CropIn uses AI and satellite imagery for crop monitoring and management.\nAdditionally, the \"Kisan Suvidha\" app by the Indian government empowers farmers with\nAI-driven advisory services for crop cultivation.\nAs for past developments, AI applications such as predictive analytics, satellite imagery\nanalysis, and machine learning-based disease detection systems have helped farmers\nmake informed decisions about crop planting, irrigation, and pest management (Kumar\net al. 2019). AI-driven technologies like chatbots and mobile apps have also enhanced\nfarmers' access to information on weather forecasts and market prices, leading to more\nefficient resource utilization and crop marketing (Arora et al. 2020).\nTechnologies in drones are quickly gaining trust among farmers by providing new ways of\nincreasing\ncrop\nyields\nthrough\nin-\ndepth\nanalysis,\nlong-distance\ncrop\nspraying\nand\nhigh-efficiency crop analysis. Practical applications for drone technology are becoming more\nprevalent, therefore it is likely that drone-powered solutions will be on the notch over the next\nfew years. Drone based solutions in the agriculture sector have a lot of implications like dealing\nwith adverse climatic conditions, productivity gains, precision farming and crop yield\nmanagement.\nPlatforms like Jivabhumi's 'Food print' aggregates and traces farm produce, and offers a digital\nmarketplace. It uses blockchain technology to connect farmers and institutional buyers via an\nefficient and traceable supply chain (Baruah, 2019).\nIn the current scenario, AI's role in Indian agriculture has continued to evolve. AI-powered\ndrones, for instance, are being used for crop monitoring, and machine learning algorithms have\nbeen developed to predict crop diseases based on visual symptoms (Thakur et al. 2021).\nGovernment initiatives like the \"Digital India\" program have further encouraged the adoption of\nAI technologies, and several startups are offering AI-driven solutions to address the diverse\nchallenges of the sector, from soil health assessment to crop yield prediction (NITI Aayog,\n2020)."}, {"id": 34, "username": "oscar", "text": "In the present landscape, AI in Indian agriculture is witnessing ongoing work in several\nkey areas. Authors like Gupta et al. (2021) have focused on using AI to predict market prices\nand optimize supply chains, reducing post-harvest losses. Meanwhile, projects like Microsoft's\n\"FarmBeats\" are exploring the use of AI and IoT to provide data-driven insights to farmers.\nFurthermore, the use of AI in image recognition for disease and pest detection, as studied by\nRathi et al. (2020), holds immense potential to bolster crop health. The deployment of drones\nand AI for soil health assessment and irrigation management, as researched by Arora et al.\n(2020), is another promising avenue of development.\nUSE OF EXPERT SYSTEM\nAn expert system is a computer program created to mimic how human experts in a particular\nfield or domain solve problems. In order to create a structure that better meets the specific on-site\nneeds of farmers, expert structures in agriculture combine the knowledge of several disciplines,\nsuch as plant pathology, entomology, horticulture, and agricultural meteorology (Prasad and\nBabu, 2006).\nThe diagnostic, prediction, and farm management models are among the farm-related\nproblem-solving models that are the main focus of agriculture's expert system. A farmer may be\nable to communicate with the system in their native tongue and receive a solution to the given\nproblem using this expert system (Rafea et al. 1993). The farmer can use the keyboard to type a\nquery or interact visually, and the system will respond by displaying it on the screen.\nUSE OF ARTIFICIAL NETWORK\nArtificial neural networks (ANNs) are computer systems that attempt to mimic the\nbiological neural networks that make up human brains in order to solve complex\nproblems (Thyagarajan, 1998; Marchant and Onyango, 2002)."}, {"id": 35, "username": "oscar", "text": "To develop an ANN\nsystem, at least three layers are usually needed: the input layer, the hidden layer, and the\noutput layer. The study's particular problem will determine how many hidden nodes are\npresent. According to Kaul et al. (2005), the input nodes match the input variables, and\nthe output nodes match the output variables. The input layer is responsible for allocating\ninputs to several hidden layers, each of whose outputs is linked to an output layer where\nunit outputs are connected to the subsequent unit's inputs by connection weight\n(Marchant and Onyango, 2002).\nAgriculture has been using artificial neural networks for a while now for a variety of\napplications,\nincluding\nyield\nprediction (Drummond et al. 1995), agricultural\neconomics (Chen, 2005), weed identification (Zhang et al. 1994), crop nutrition\ndiagnosis (Song and He, 2005), modeling the terminal velocity of agricultural seeds\n(Ghamari et al., 2010), combine harvester control (Hall and Lu, 1992), etc.\nUSE OF FUZZY LOGIC\nIn order to deal with imprecision, vagueness, and inadequate knowledge, fuzzy logic is\nemployed. Expert systems can function at their best with unknown or ambiguous data\nand information thanks to fuzzy logic. Fuzzy expert systems use fuse logic as an\nalternative to conventional Boolean logic.\nIn essence, a fuzzy set is one whose members can have membership degrees ranging\nfrom 0 to 1. This is in contrast to classical sets, where an element's membership degree\ncan only be either 0 or 1, meaning that if it is 0, it is completely outside the group; if it\nis 1, it is inside the group. Rather than employing traditional Boolean logic and a set of\nmembership functions and rules to reason about data, fuzzy expert systems use fuzzy\nlogic. They handle ambiguous or imprecise information and are geared toward\nnumerical processing."}, {"id": 36, "username": "oscar", "text": "When combinations of conditions result in conclusions, IF-THEN\nrules are applied to the terms of the linguistic variables (Abraham, 2005).\nTABLE 4: GOVERNMENT INITIATIVES AND STARTUPS FOR DEEPER INTEGRATION OF\nAI IN AGRICULTURE\nPROJECT\nNAME\nPROBLEM/\nOBJECTIVE\nSOLUTION/ APPROACH\nIMPACT/\nIMPLEMENTATION\nAI sensors to\nmake farming\nsmarter\nIndia has embarked\non\na\njourney\nto\nbring\nAI\nsensors\ninto the agriculture\nfield. The aim is to\nhelp\nthe\ncommunity\nto\nrecord information\ndigitally, cut costs\nand increase yields\nwith a smartphone\nin their hand.\nMicrosoft is collaborating\nwith Indian farmers, state\ngovernments,\nand\nministries\nto\nenhance\nagricultural\nproductivity\nusing AI. The AI Sowing\nApp,\npowered\nby\nMicrosoft's\nCortana\nIntelligence\nSuite,\noffers\nsowing\ntips\nvia\ntext\nmessages\nwithout\nadditional costs or sensors.\nThe\nMoisture\nAdequacy\nIndex\n(MAI)\ncalculates\noptimal\nsowing\nperiods\nbased on real-time rainfall\ndata."}, {"id": 37, "username": "oscar", "text": "Microsoft's Pest Risk\nPrediction API, developed\nwith UPL, predicts pest\nattacks, reducing crop loss.\nAdditionally,\na\nmultivariate\nagricultural\ncommodity\nprice\nforecasting model utilizes\nsatellite\nimages\nfor\npredicting crop yields and\nassociated prices, fostering\nincreased farmer income.\nIn addition to issuing\nadvisories to farmers\nwithin the state, the\nKarnataka\ngovernment\nwill\nbegin\nusing\nprice\nforecasting\nfor\nagricultural\ncommodities.\nThree\nmonths\nahead\nof\ntime,\ncommodity\nprices\nfor\nproducts\nlike\ntur,\nof\nwhich\nKarnataka\nis\nthe\nsecond-largest\nproducer,\nwill\nbe\nforecast for the state's\nmain\nmarkets.\nFarmers\nin\nthe\nvillages of Telangana,\nMaharashtra,\nand\nMadhya Pradesh are\nnow\ngetting\nautomated voice calls\ninforming them of the\nlikelihood of a pest\nattack on their cotton\ncrops based on crop\nstage and weather.\nAn\nAI-backed\nplatform\nthat\nmeasures\nthe\nefficacy\nof\nAgri-inputs on\nfarm produce\nAn\nagrochemical\ncompany\nwas\nlooking\nfor\na\npartner\nto\ninvestigate\nthe\nviability\nof\nestimating the size\nof the corn plant's\nleaves in order to\nmeasure\nthe\nefficacy\nof\nagri-inputs on corn\nplants.\nGrowing\ncorn\nfollows\na\nIn order to estimate the\nleaf\narea\nindex,\nthe\nagrochemical\ncompany\nworked\nwith\nTiger\nAnalytics\nto\nuse\ndrone\nphotos\nof\nthe\nfarm\ncombined\nwith\ndeep\nlearning-based\nimage\nprocessing methods. The\nobjective was to compare\nthe produce of the farm\nregions with varying levels\nof fertilizer utilization and\nto use drone imagery of the\nEvery week during\nthe implementation\nphase, land plots\nwere observed."}, {"id": 38, "username": "oscar", "text": "In\norder to simulate\nreal-world data and\nprecisely capture leaf\narea index based on\nthe simulation\nparameters, data was\nartificially created\nwith deep knowledge\nof vegetation science\nto address any issues\nprogressive pattern\nin which the health\nof\nthe\nplant\nis\nassessed\nby\nmeasuring the area\nof\nits\nleaves;\nunhealthy\nplants\nhave\nnarrower,\nmore\ntwisted\nleaves than healthy\nones.\nMeasuring\nthe corn plants' leaf\narea was the main\nobjective.\nUnfortunately,\nthe\nlabor-intensive\nmanual\nmethod\nmade it impractical\nto measure leaves\nacross wide areas\nof plants.\nfarm\nto\ndetermine\nthe\ngrowth\nparameters\nof\nindividual\nplants.\nThe\ninitiative, spearheaded by\nTiger Analytics, involved\noutfitting\ndrones\nwith\nZENMUSE\ncameras\nin\norder\nto obtain superior\nquality photos of the farm.\nIn order to distinguish crop\nsections related to those\nrows of corn plants that\nneeded\nto\nbe inspected,\nthey also put markers on\nthe\nground.\nTiger\nAnalytics used Blender, an\nopen-source 3D computer\ngraphics\nprogram,\nto\nstimulate training data in\norder\nto\nhave\nenough\nsamples\nfor\nthe\ndeep\nlearning models. The study\nof discriminative features\nthat\nconsistently\nfunctioned on real-world\nimages\nwas\nthen\nmade\npossible\nby\nthe\nfinely\ntuned models. To construct\ndeep\nlearning\nmodels,\nPyTorch was utilized.\nwith the use of deep\nlearning models. On\nthe farms, the\nagrochemical\ncompany was able to\nevaluate the\neffectiveness of\nvarious products on a\nsizable sample. The\nfarm was split up into\nareas that received\nvarious treatments;\nover the course of\nseveral weeks, the\ngrowth parameters\nwere precisely\nmeasured and\nprovided back to the\nproduct development\nand research teams\nfor further\nexamination. The\nsolution included a\nstrategic image\ncapture and scoring\npipeline with a clear\npath to derive\nfarming intelligence\nfrom sensors, a\nrobust and\ngeneralizable deep\nlearning inference,\nand a unique and\ndetailed method to\ncreate synthetic\nimages."}, {"id": 39, "username": "oscar", "text": "The results\nfor the synthetic test\nimages showed a\nsignificant reduction\nin the mean absolute\nerror when it came to\nidentifying the\nimages of diseased or\naffected crops.\nArtificial\nIntelligence to\nadvise farmers\non pests and\ndiseases in\nCrops are impacted\nby numerous pests\nand\ndiseases\nall\nover the world. The\nmajority\nof\nTNeGA has pioneered an\nAI-powered\nsolution\nfor\nfarmers,\naccessible\nvia\nsmartphones,\naiding\nin\nearly\ndisease\nand\npest\nIn Tamil Nadu, the\nratio\nof farmers to\nground experts makes\nit nearly impossible\nto\nprovide\ndaily,\ncrops\nfarmlands in India\nare owned by small\nand\nmarginal\nfarmers who lack\naccess\nto\nthe\nnecessary resources\nand are frequently\nmisled\nby a few\nfertilizer\nvendors.\nAs a result, they\nfrequently\nexperience\ncrop\ndamage and other\nrelated\nissues,\nwhich\nultimately\nresults in a sizable\nloss of income that\nnegatively impacts\ntheir\nability\nto\nsupport\nthemselves.\nThis\nhas an immediate\neffect on farmers,\ntheir families, and\nultimately\nthe\nagriculture-depend\nent economy.\nidentification\nfor\npaddy\nand\nmaize crops."}, {"id": 40, "username": "oscar", "text": "Using\ndeep\nlearning\nand\na\npre-built knowledge base,\na model trained on images\nfrom Tamil Nadu's fields\nachieves\n80%\naccuracy.\nThe system collects ground\ndata,\nincluding\nGIS\ncoordinates,\ncrop\nstage,\nuser queries, and images,\nto\ncontinuously\nimprove\nand\nexpand\nsupport\nfor\nvarious\ncrop\nscenarios,\nbenefiting\nfarmers\nand\nstakeholders.\nin-person\nassistance\nto\nevery\nfarmer.\nDespite\nreceiving\nvery little notice of\nits\nexistence,\nthe\nAgriculture\nDepartment's TNeGA\nwas\nable\nto\nfulfill\nabout 10,000 requests\nfrom farmers in a 3-\nto\n4-month\nperiod.\nThe system's ability\nto assist farmers in\ntheir\nnative\ntongue\nadds to its reach and\nis another advantage.\nWith the help of the\nAgriculture\nDepartment's\nrequests,\na\nrich\ndataset was created.\nBy\nvisualizing\nthe\npatterns in the data,\ndata analysis allowed\nfor the validation of\nstressed areas as well\nas the onset of any\ndiseases or pests.\nAI for livestock\nmanagement\nTo\nimprove\nperformance,\nadequate\nbreeding\npractices must be\ncombined\nwith\nappropriate\nlivestock\nmanagement\nand\nmonitoring\ntechniques, such as\ntimely vaccination\nand\ndeworming\ncare, individualized\nnutrition and feed\nmanagement,\nand\npre-\nand\npost-delivery\ncare\nof livestock. Local\nbulls are used as\nstud by traditional\nfarmers\nfor\nTCS provides an integrated\nportfolio\nof\nbusiness,\ntechnology,\nand\nengineering\nservices and\nsolutions that are led by\nconsulting and powered by\ncognitive\ntechnologies.\nTCS\nis\nknown\nfor\nits\nexceptional\nlocation-independent agile\ndelivery model, which has\nmade it a benchmark for\nsoftware\ndevelopment\nexcellence. Through their\nmKRISHI platform, TCS's\nsolution\nprovides\ninformation\nand\ncommunication technology\n(ICT) to livestock. They\nhave teamed up with the\nbiggest livestock initiative\nTCS offers\nconvenient, real-time\npalmtop awareness\non cattle care\nmanagement\nprocedures, anomaly\nmonitoring,\nretraining\nrequirements, and\nobservation\ngeneration."}, {"id": 41, "username": "oscar", "text": "In just\nfive to six years, this\nhelps progeny\nmilking performance\nincrease from 2-3\nlitres per day to\n14-16 litres per day.\nBecause the solution\nproduces an excess of\n12–13 liters per day,\nit increases profits\ninsemination,\nwhich\ntaints\nthe\npurity\nof\nfemale\noffspring\nand\ninterferes\nwith\nfuture generations'\ndevelopment\nand\nmilk\nproduction.\nNumerous\norganizations offer\nheat\ndetection,\nbreeding\ntechniques,\nand\nother animal best\nmanagement\npractices that have\nbeen validated by\nscience.\nin\nIndia\nto\ncross-breed\nindigenous\nand\nexotic\ncattle\nbreeds\nusing\nselective\nartificial\ninsemination in order to\nsystematically improve the\nbreed.\nBy\nemploying\n\"Artificial Intelligence on\nArtificial\nInsemination,\"\nTCS uses ICT to determine\nwhich bull is most suitable\nfor insemination, thereby\nincreasing milk yield.\nand decreases hunger.\nAI for weather\nadvisory in\nadvance for\ncrops\nBefore\ncrops\nmature,\naccurate\ninformation\nabout\ntheir\nproduction\nstatus is necessary\nto plan for imports,\nexports, or buffers\nwell in advance of\nshortages\nor\nsurpluses.\nOriginally\ncalled\nBK\nConsimpex Pvt. Ltd., BKC\nWeatherSys\nPvt. Ltd. is\namong\nthe\nfirst\nfew\nprivately\nowned\nmeteorological\nand\nenvironmental technology\ncompanies in India. BKC\nWeatherSys\nwas\nestablished\nin 1989 and\noffers turn-key technology\nand service solutions to the\npower,\nweather,\nsolar\nenergy,\naviation,\nand\nagricultural\nsectors.\nFarmers\ncan\nreceive\nweather\nadvisories\nin\nadvance\nrelated\nto\nthe\ncrops they grow through\nthe Fasal Salah app. The\ncrop\ninsurance\nsystem,\nwhich\ndepends\non\nthousands of crop-cutting\nexperiments,\nis currently\nbeset with issues such as\ndelayed\nyield\ndata\nsubmission\nfor\ndamage\nassessment, mistrust of the\ndata's quality, and delayed\npremium subsidy payments\nfrom state governments to\nMore\nthan\na\nlakh\nfarmers have found\ngreat satisfaction in\nthe solution, as they\nuse\nthe\napp\nto\nforecast yield, learn\nabout\ntraders, input\nsuppliers, and mandi\nprices, as well as to\nreceive\nhighly\npersonalized\nand\nhyperlocal\nweather\nforecasts.\ninsurance companies."}, {"id": 42, "username": "oscar", "text": "This\napp\ncan\nserve\nas\nan\nadditional\ntool\nfor\nthe\nsystem.\nAI for farm\nmanagement\nGiven that there are\n2.5\nlakh\ngram\npanchayats\nin\nIndia,\nconducting\nCrop\nCutting\nExperiments\n(CCEs) in a short\namount of time is a\nchallenge.\nFurthermore,\nbecause\nheterogeneity\nof\nyield is not taken\ninto account by the\nconventional\nrandom\nsurvey\nmethod used, there\nis\na\nchance\nthat\ninsurance decisions\nmade at the farmer\nlevel\nmay\nbe\nmiscalculated.\nKrishna Kumar, founder of\nCropIn,\naddresses\nchallenges faced by Indian\nfarmers since 2009 through\nAgtech solutions. CropIn's\nproducts,\nincluding\nmWarehouse, SmartFarm,\nand\nSmartRisk,\nleverage\ntechnology\nfor\nseamless\nfarm\nmanagement.\nSmartFarm tracks weather,\nfield\ndata,\nand\nthreats,\nrecording\nfarm\ndetails,\nwhile SmartRisk employs\nAI and machine learning\nfor predictive analysis of\ncrop cycles."}, {"id": 43, "username": "oscar", "text": "These tools\nenhance\nmonitoring,\nensuring\ntimely\nand\nobjective data for the Crop\nCutting Experiment (CCE)\nsample selection process.\nBoth SmartFarm and\nSmartRisk make sure\nthat\nthe\nfield\nis\nwatched\nover\nfrom\nthe\nstart\nof\nevery\ncultivation\ncycle,\nmaking it easier for\nauthorities to gather\npertinent information\nat the right moment\nand\nincreasing\nthe\nobjectivity\nand\nscientificity\nof\nthe\nCCE\nsample\nselection\nprocess.\nFarmers\ncan\nbetter\nunderstand\ntheir\ncrops\nand\nthe\ndiseases\nthat\naffect\nthem\nby\nusing\nCropIn's\nlocally\ndeveloped solutions.\nAI to empower\nfarmers by\ndelivering\nintelligent\ninsights,\nexpertise, and\nothers\nresources to\nincrease yield\nDue to low yield,\nhigh\ninput\ncosts,\nincreased risks, and\nunsustainable\noperations,\ngrowing food crops\nhas\nbecome\nunfeasible\nfor\nsmall-scale\nfarmers, leading to\nan\nincrease\nin\nagrarian\ndistress.\nSmall-scale\nfarmers'\nproductivity\nhas\nbeen impacted by\nthe world's hunger\ncrisis\nand\nfood\nsecurity,\nwhich\nhave resulted in a\nlack of access to\nquality agro-inputs,\nweak\nmarket\nMyCrop is a cooperative\nplatform\nthat\nbuilds\nan\necosystem\npowered\nby\ncutting-edge technology to\ngive\nfarmers\naccess\nto\nresources, knowledge, and\nexpertise through \"farmer\nmitras.\" By raising their\nproductivity\nand\nprofitability,\nit\nseeks\nto\nimprove\nthe\nlives\nof\nfarmers and their standard\nof\nliving.\nA\ntechnology-enabled\nprogram\ncalled\nMyCrop\nseeks to empower farmers\nby\nproviding them with\nresources, knowledge, and\nastute insights."}, {"id": 44, "username": "oscar", "text": "By raising\nyields, lowering cultivation\ncosts,\nand\nimproving\nmarket\nconnections,\nit\nseeks\nto\nboost\nfarmers'\nMore\nthan\n4,000\nfarmers\nhave\nbeen\ndirectly\nreached\nby\nMyCrop's\nsolution,\nand\nmore\nthan\n30\n\"farmer mitras\" have\nbeen\nregistered.\nFarmers\ncan\nlower\ncultivation\ncosts,\nimprove quality and\nproductivity, and gain\nbetter market access\nwith this solution.\nconnections,\nlimited\nor\nnonexistent\ncredit\navailability, and a\nlack of information\nabout\neffective\nagricultural\npractices.\nFurthermore,\nin\norder\nto\nprovide\ntheir services in the\nmost effective way\npossible, players in\nthe\nagriculture\necosystem\nlack\nreal-time\ninsights\ninto\nfarming\nactivities\nthat are\nrelated\nto\nthe\nground.\nprofitability and raise their\nstandard\nof\nliving.\nIn\naddition\nto\nbeing\na\ndata-driven,\nreal-time,\nscalable,\nsustainable\nself-learning system, it also\nfunctions\nas\na\ndecision\nsupport\nsystem,\na\npredictive\nanalysis\nand\nmonitoring\ntool,\na\nfarm/farmer\nmanagement\nsolution, and an agriculture\ne-commerce platform.\nAI for\noptimizing\nirrigation\nCrop irrigation was\ngetting\nharder\nbecause of unstable\npower supplies and\nthe waste of limited\nresources\nlike\nwater\nand\nelectricity\nbrought\non by the use of\nauto\nswitches.\nFarmers had to pay\nup to INR 30,000\nin maintenance and\noverhead expenses\nper\npump\nwhen\nirregular\nvoltage\nfluctuations, motor\nburn, wire cut, and\ndry\nrun\ncaused\ndamage\nto\nthe\npump.\nThey\nconsequently began\nimplementing\nauto-switch, which\nactivates\nmotors\nwhen\npower\nbecomes available.\nThe\ngoal\nof\nthe\nagriculture-focused\nstart-up\nKisanRaja is to\ndevelop\ncutting-edge,\nreasonably\npriced\ntechnology\nproducts\nand\nInternet\nof\nThings\nsolutions\nfor\ndeveloping\nnations.\nThrough\nits\nflagship brand, KisanRaja,\nthe\ncompany\noffers\ncloud-based IoT solutions\nintegrated\nwith\nwireless\nsensors,\nmobile\npump\ncontrollers,\nand\nwireless\nvalve controllers for smart\nautonomous\nirrigation.\nAdoption\nof\nthe mobile\nmotor controller will result\nin significant water savings\nwith KisanRaja's solution.\nHere, the pumps are linked\nto a cloud server so that the\nborewell's discharge can be\ntracked\nand\nmanaged.\nPump sets have the ability\nto\nbe\nturned\noff\nand\noperated\nremotely.\nThe\n\"Internet of Pumps\" helps\nKisanRaja's\nsolution\nhelps\nlower\nthe\namount\nthe\ngovernment must pay\nfor power subsidies,\nlengthen the life of\ngroundwater\nsupplies,\nand\nraise\nfarmers'\nper\ncapita\nincome\nthrough\nhigher profit margins\nbrought\nabout\nby\nlower\nlabor,\nfuel,\nequipment\nupkeep,\nand\nfertilizer\ncosts.\nContinuous\nwater\nmonitoring increases\nfarm productivity by\n12–15%,\nwhich\ncontributes to power\nsavings of up to 25%\nand a 30% decrease\nin pump maintenance\nexpenses.\nfarmers\noperate\ntheir\npumps\nonly\nwhen\nnecessary and tracks the\nquantity of water saved.\nAdditionally,\nthe\ntechnology can be applied\nto\nmicro-irrigation\nsystems.\nAI for quality\nassaying\nagricultural\nproducts\nCurrently,\nquality\nassaying\nin\nagriculture is done\nmanually,\nwhich\nadds\nsubjectivity,\ntime, and potential\nfor\nfraud\nto\nthe\nresults."}, {"id": 45, "username": "oscar", "text": "A scalable,\ndependable,\nuser-friendly\nquality\nassaying\nsystem\nthat\nis\nsuitable for use at\nall national mandis\nis\nrequired.\nObtaining\nhigh-quality results\nin a digital format\nthat\ncan\nbe\nuploaded\non\nthe\neNAM platform is\ncrucial\nbecause\nlabs and machines\nare\ncostly\nand\nscarce.\nAn agricultural technology\nstart-up called Intello Labs\nis developing a platform\nfor\ngrading\nand\nquality\nmonitoring of agricultural\ncommodities\nusing\nartificial intelligence (AI)\ntools like computer vision\nand deep learning. With\nthe use of a smartphone\napp, Intello Labs offers an\nimage-based solution that\nhelps\nstandardize\nand\nincrease\ntransparency\nin\nquality assessment while\nlowering waste and value\nrisk in agricultural supply\nchains.\nAn\napplication\ndesigned to test, grade, and\nanalyze\nvisual\nquality\nparameters of agricultural\nproducts\nhas\nbeen\ndeveloped by Intello Labs.\nAt\nthe\nmoment,\nthey\nprovide testing and grading\nservices\nfor\ncardamom,\npotatoes, tomatoes, onions,\nand\nwheat.\nThey\nare\ncurrently expanding their\nportfolio with six or seven\nadditional\ncommodities,\nsuch as tea, coffee, and\ngrapes.\nWith\nthe\nsolution,\nquality testing takes\nonly\ntwo\nminutes\ninstead of fifteen, and\nthe\nresults\nare\nof\nhigher\nthan\nninety-five\npercent\naccuracy.\nIt\neliminates\nsubjectivity,\nstandardizes\nquality\nassessment,\nand\npermits real-time data\nsharing across many\nscreens and locations.\nAI sensors to\nmake farming\nsmarter\nIndia has started a\nproject to integrate\nAI sensors into the\nagricultural\nindustry.\nWith\na\nsmartphone\nin\nhand, the goal is to\nassist\nthe\nMicrosoft, in collaboration\nwith\nIndian\nauthorities,\nempowers\nsmallholder\nfarmers through AI-driven\nsolutions."}, {"id": 46, "username": "oscar", "text": "The AI Sowing\nApp,\npart\nof\nCortana\nIntelligence Suite, advises\nfarmers on optimal sowing\nIn addition to issuing\nadvisories to farmers\nwithin the state, the\nKarnataka\ngovernment\nwill\nbegin\nusing\nprice\nforecasting\nfor\nagricultural\ncommunity\nin\ndigitally recording\ninformation,\nreducing\nexpenses\nand\nincreasing\nyields.\ndates\nwithout\nadditional\ncosts\nor\nsensors.\nThe\nMoisture Adequacy Index\ncalculates\nideal\nsowing\nperiods,\nwhile\nthe\nPest\nRisk\nPrediction\nAPI\npredicts\npest\nattacks,\nreducing\ncrop\nloss.\nMicrosoft's\ncommodity\nprice\nforecasting\nmodel\nutilizes satellite data for\npredicting\nfuture\ncrop\nyields and prices.\ncommodities.\nThree\nmonths\nahead\nof\ntime,\ncommodity\nprices\nfor\nproducts\nlike\ntur,\nof\nwhich\nKarnataka\nis\nthe\nsecond-largest\nproducer,\nwill\nbe\nforecast for the state's\nmain\nmarkets.\nFarmers\nin\nthe\nvillages of Telangana,\nMaharashtra,\nand\nMadhya Pradesh are\nnow\ngetting\nautomated voice calls\ninforming them of the\nlikelihood of a pest\nattack on their cotton\ncrops based on crop\nstage and weather.\nSOURCE: INDIAI- A meity initiative.\nFig 5: How sowing app helps the farmers[42]\nPollution Free Zone (PFZ):\nPollution-free zone in agriculture is a designated area where the use of synthetic\nchemicals, such as pesticides, herbicides, and fertilizers, is prohibited or severely\nrestricted. The goal of pollution-free zones is to create a sustainable agricultural system\nthat minimizes environmental pollution and protects human health.\nReasons for implementing pollution-free zones in agriculture:\nReduce environmental pollution: Synthetic chemicals can contaminate soil, water, and\nair, posing risks to human health and the environment. Pollution-free zones help to\nreduce the use of these chemicals and mitigate their negative impacts.\nProtect human health: Exposure to synthetic chemicals can have a number of adverse\nhealth effects, including cancer, neurological disorders, and reproductive problems.\nPollution-free zones help to reduce human exposure to these chemicals.\nPromote biodiversity: Synthetic chemicals can harm beneficial insects and other\norganisms that are essential for healthy ecosystems."}, {"id": 47, "username": "oscar", "text": "Pollution-free zones help to protect\nthese organisms and promote biodiversity.\nImprove soil health: Synthetic chemicals can damage soil structure and reduce soil\nfertility. Pollution-free zones help to improve soil health by promoting the use of\norganic farming practices.\nEnhance food quality: Food grown in pollution-free zones is often considered to be of\nhigher quality because it is free from synthetic chemicals.\nRequirements for implementing pollution-free zones in agriculture:\nGovernment support: Government support is often necessary to help farmers transition\nto organic or other forms of sustainable agriculture. This support can take the form of\nsubsidies, loans, and technical assistance.\nConsumer demand: Consumer demand for organic and other sustainably produced food\nis\nessential\nfor\nthe\nsuccess\nof\npollution-free\nzones.\nConsumers\ncan\nsupport\npollution-free agriculture by buying organic food and other products that are certified to\nbe free from synthetic chemicals.\nFarmer education and training: Farmers need to be educated about the benefits of\npollution-free agriculture and how to implement sustainable farming practices. Training\nprograms can help farmers learn how to manage pests, diseases, and weeds without the\nuse of synthetic chemicals.\nCountries that have been implementing PFZs:\nUnited States: The United States has a number of programs in place to reduce pollution\nin specific areas, such as the Clean Air Act and the Clean Water Act. These programs\nhave helped to reduce pollution levels in many areas of the country.\nEuropean Union: The European Union has a number of directives in place to reduce\npollution, such as the Air Quality Directive and the Water Framework Directive. These\ndirectives have helped to reduce pollution levels in many areas of the EU.\nChina: China has established a number of PFZs in recent years, including the\nBeijing-Tianjin-Hebei PFZ, the Yangtze River Delta PFZ, and the Pearl River Delta\nPFZ."}, {"id": 48, "username": "oscar", "text": "These zones have been successful in reducing air pollution in these areas.\nThe types of agriculture products that are produced in PFZs can vary depending on the\nlocation and climate of the zone. Some examples of agricultural products that are\nproduced in PFZs include:\nFruits and vegetables: Fruits and vegetables are often grown in PFZs because they are\nsensitive to air pollution.\nOrganic food: Organic food is often grown in PFZs because it is produced without the\nuse of synthetic pesticides or fertilizers.\nSpecialty crops: Specialty crops, such as herbs and spices, are often grown in PFZs\nbecause they can be produced in small spaces and do not require a lot of water.\nChallenges in Health sector:\nLimited evidence base for the effectiveness of agriculture products: While there is a\ngrowing body of research on the health benefits of agriculture products, more\nhigh-quality studies are needed to establish their efficacy. This is particularly true for\nthe use of agriculture products in the prevention and treatment of chronic diseases.\n\"Public Health Nutrition\" found that only 25% of hospitals in the United States had a\nsalad bar or other options for patients to obtain fruits and vegetables.\nLack of awareness and knowledge among healthcare professionals: Healthcare\nprofessionals may not be aware of the potential benefits of agriculture products for\nhealth promotion and disease prevention. This can be due to a lack of training in\nnutrition and food science, as well as a focus on pharmaceutical interventions. A study\npublished in the journal \"Nutrition and Dietetics\" found that only 36% of nurses were\naware of the recommended intake of fruits and vegetables.\nRegulatory challenges: The regulation of agriculture products varies from country to\ncountry."}, {"id": 49, "username": "oscar", "text": "In some cases, there may be a lack of clear regulatory pathways for the\napproval of agriculture products for health use. This can make it difficult for companies\nto bring these products to market. \"Food and Drug Law Journal\" found that there is a\nlack of clear regulatory guidance on the use of dietary supplements in hospitals.\nROLE OF ARTIFICIAL INTELLIGENCE IN AGRICULTURAL SECTOR\n1. Satellite Imaging and Remote Sensing:\n●\nCrop Monitoring:\n●\nSatellite imagery provides high-resolution views of agricultural fields, allowing\nfarmers to monitor crop health, growth, and identify anomalies.\n●\nRemote sensing technologies help capture data beyond the visible spectrum, such as\ninfrared, to detect variations in crop conditions that may not be apparent to the\nnaked eye.\n●\nYield Estimation:\n●\nBy analyzing satellite images throughout the growing season, machine learning\nalgorithms can estimate crop yields. This is done by correlating various factors like\nvegetation indices, climate data, and historical yield information.\n●\nIdentifying Stress Factors:\n●\nSatellites can detect stress factors in crops, such as water scarcity, nutrient\ndeficiencies, or pest infestations, enabling farmers to take corrective actions in a\ntimely manner.\n2. Machine Learning and Predictive Analytics:\n●\nCrop Disease Prediction:\n●\nMachine learning models analyze historical data on crop diseases, weather\nconditions, and soil types to predict the likelihood of disease outbreaks. Early\ndetection allows for timely intervention.\n●\nWeather Forecasting:\n●\nMachine learning algorithms can process vast amounts of historical weather data to\nmake accurate predictions. This helps farmers plan planting and harvesting times,\nirrigation schedules, and prepares for extreme weather events.\n●\nSoil Health Assessment:\n●\nML models process data from soil sensors, satellite imagery, and historical records\nto assess soil health."}, {"id": 50, "username": "oscar", "text": "This includes nutrient levels, pH, and moisture content,\nguiding farmers in optimizing fertilizer use and irrigation.\n●\nExample: The use of deep learning models to analyze images of crops and identify visual\ncues indicating the presence of diseases.\n3. IoT and Sensor Technologies:\n●\nPrecision Agriculture:\n●\nIoT devices and sensors, such as drones equipped with cameras and soil sensors,\nprovide real-time data on crop conditions. This data is used for precise\ndecision-making, optimizing resource use, and reducing waste.\n●\nMonitoring Farm Conditions:\n●\nSensors placed throughout the farm collect data on temperature, humidity, soil\nmoisture, and other relevant parameters. This information aids in assessing overall\nfarm health and responding to environmental changes.\n●\nAutomating Processes:\n●\nIoT devices can control and automate various agricultural processes, including\nirrigation, fertilization, and pest control."}, {"id": 51, "username": "oscar", "text": "For example, smart irrigation systems\nadjust water usage based on real-time soil moisture levels.\n●\nExample: The use of drones equipped with multispectral cameras for monitoring crop\nhealth and deploying targeted interventions.\nFig 6: Components of machine based precision agriculture[43]\nFig 7: Tomato and Brinjal productivity comparison using precision and imprecision farming[44]\nTable 5: Comparison table for farming with precision agriculture[44]\nTABLE 6: AGRICULTURAL VARIABLES\nBelow is a list of factors that affect agricultural productivity, our next motive would be to\nfurther analyze these factors using artificial intelligence.\nFACTORS\nDESCRIPTION\nRef.\nSocio-Economic\nChallenges in\nAgricultural\nDevelopment\nAgro-Ecological\nResilience : High\nrise in population,\nCultural practices,\nImported\ntechnologies, Lack\nof knowledge,\nGlobal market\ndynamics, Insect\npests, Land\nownership patterns,\nFertilizers use\nThe high rise in\npopulation in India poses\npressure on agricultural\nresources, leading to\nincreased demand for\nfood, land, and water,\nexacerbating the\nchallenges faced by the\nagricultural sector in\nmeeting the needs of a\ngrowing populace.\nTraditional farming\npractices, if not aligned\nwith modern techniques,\ncan affect productivity.\nDependence on foreign\ntechnologies raises\nquestions about\nself-sufficiency and\nadaptability, insufficient\naccess to information,\nand unawareness of\nmodern technologies,\nhindering farmers' ability\nto adopt sustainable\npractices and navigate\nchallenges.\nChanges in global market\ntrends impact the\ndemand and prices of\nagricultural products.\nInsects, including pests,\ncan damage crops by\nfeeding on plant tissues\nor transmitting diseases.\nThe use of fertilizers in\nIndian agriculture faces\nissues such as\n“NITI Aayog (2020),\nM.V.Prabhakaran,\nKavitha.G (2019),\nMinistry of\nAgriculture & Farmers\nWelfare. (n.d.).\nPradhan Mantri Fasal\nBima Yojana,\nRao, et al."}, {"id": 52, "username": "oscar", "text": "(2022),\nArtificial Intelligence\nfor Pest and Disease\nManagement in Indian\nAgriculture”\nFACTORS\nDESCRIPTION\nRef.\nimbalanced application,\noverreliance on chemical\nfertilizers, and the need\nfor sustainable nutrient\nmanagement to enhance\nsoil fertility and\nminimize environmental\nimpact.\nAgricultural\nEcosystem\nOptimization\nFarmer’s access to\ncredit & market,\nSubsidy\ndistribution,\nResearch and\ndevelopment\nfunding, Consumer\npreferences\nLimited financial\nresources can hinder\nfarmers' ability to invest\nin modern agricultural\npractices.\nInefficiencies in subsidy\ndistribution can hinder\nthe equitable distribution\nof resources.\nInsufficient funding for\nagricultural research\nlimits innovation and\ntechnology development.\nShifting consumer\npreferences for specific\ncrops impacts farmers'\ndecisions.\n“Government of India.\n(2000) National\nAgriculture Policy,\nGovernment of India,\nNational Mission on\nSustainable\nAgriculture, Pradhan\nMantri Kisan Samman\nNidhi,\nTuli, R., et al. (2018),\nRao, PradeshJaswanth,\net al. (2022), Prasad R\net al. 2002”\nGovernment\nBarrier: Intersecting\nGlobal Policy\nChallenges\nResource\nGovernance :\nLand reforms, Water\npolicies, Climate\nchange agreements,\nData privacy\nconcerns\nDelays and challenges in\nimplementing land\nreforms can impact\nland-use patterns.\nIssues related to water\nallocation and\nmanagement can affect\nirrigation practices.\nGlobal agreements on\nclimate change influence\nfarming practices and\nenvironmental\nsustainability.\nConcerns about data\nprivacy may hinder the\nadoption of digital\n“Anurag Saxena, et al.\n(2020), NITI Aayog\n(2020),\nThakur, S., et al.\n(2021),Vinod Chandra\nS.S. (2022),\nPrakash, C. et al.\n(2013), Gupta, A., et\nal."}, {"id": 53, "username": "oscar", "text": "(2021)”\nFACTORS\nDESCRIPTION\nRef.\ntechnologies in\nagriculture.\nAssessing\nEnvironmental\nResilience Amid\nClimate Challenges\nEnvironmental\nResilience :\nExtreme\ntemperature, Floods,\nErratic rainfall\npatterns, Drought\nconditions,\nCyclones and\nstorms, Wind\nerosion, Air quality,\nLand degradation,\nSoil salinity and\nalkalinity, Soil\nerosion,\nDeforestation, Land\nfragmentation\nHigh temperatures can\nlead to heat stress in\ncrops, affecting growth,\nflowering, and fruiting\nprocesses.\nFlooding can damage\ncrops, erode topsoil, and\nlead to post-flood issues\nsuch as waterlogging and\nsoil salinity.\nInconsistent rainfall\ndisrupts traditional\nplanting schedules and\ncan lead to water scarcity\nduring critical growth\nphases.\nProlonged droughts\nresult in water shortages,\nnegatively impacting\ncrop yields and overall\nagricultural productivity.\nTropical cyclones and\nstorms can cause\nextensive damage to\nstanding crops, affecting\nlivelihoods.\nStrong winds cause soil\nerosion, depleting topsoil\nand affecting soil\nfertility.\nPoor air quality, often\ndue to pollution, can\nharm plant health and\ncrop productivity.\nContinuous cultivation\nwithout proper soil\nconservation practices\ncan result in the loss of\nsoil fertility and\n“Thakur, S., et al.\n(2021), Gupta, A., et\nal. (2021),\nAnurag Saxena, et al.\n(2020),\nGovernment of India.\n(n.d.). National\nMission on\nSustainable\nAgriculture, Ministry\nof Agriculture &\nFarmers Welfare.\n(n.d.). Pradhan Mantri\nFasal Bima Yojana,\nGovernment of India.\n(n.d.). National\nMission on\nSustainable\nAgriculture,\nRamesh A. Medar, et\nal. (2019),Artificial\nIntelligence for Pest\nand Disease\nManagement in Indian\nAgriculture,\nPrasad R et al."}, {"id": 54, "username": "oscar", "text": "2002,\nArtificial Intelligence\nfor Pest and Disease\nManagement in Indian\nAgriculture,\nArtificial Intelligence\nfor Pest and Disease\nManagement in Indian\nAgriculture,\nAI in agriculture:\nIndia’s challenges and\nopportunities 2020,\nGovernment of India.\n(2000) National\nFACTORS\nDESCRIPTION\nRef.\nproductivity.\nHigh levels of salt or\nalkaline content in the\nsoil can adversely affect\ncrop growth.\nWater and wind erosion\nlead to the loss of\ntopsoil, reducing the\nland's capacity for\nagriculture.\nReduction in forest cover\ndisrupts ecosystems,\naffecting microclimates\nand biodiversity.\nSmall and fragmented\nlandholdings make it\nchallenging to implement\nefficient and mechanized\nfarming practices.\nAgriculture Policy\n\"Use of AI, tech can\naddress challenges in\nIndian agriculture\nsector, says new\nreport\" by The\nEconomic Times\n(2023)”\nThe increasing global population, projected to reach 9.8 billion by 2050, presents a significant\nchallenge for agriculture, particularly regarding the quality of water available for irrigation. This\nchallenge arises amid constraints such as limited land availability, climate change impacts, and\nenvironmental degradation caused by excessive use of chemical fertilizers. In response, the\nintegration of artificial intelligence (AI) technologies offers promising solutions to detect and\npredict crop suitability based on sensed values, particularly in terms of water quality and\navailability.\nFor instance, utilizing Arduino UNO and a suite of sensors including soil moisture, pH,\ntemperature, and raindrop sensors, along with GSM modules, enables real-time data collection and\nanalysis for efficient water management in agriculture. Solutions aimed at promoting sustainable\npractices include the integration of wireless modules, NPK sensors for nutrient analysis, and\nIoT-based automatic water supply systems. These technologies optimize resource usage, reduce\nwater pollution and scarcity, and preserve soil fertility, ultimately enhancing agricultural\nproductivity and quality while mitigating environmental impacts.\nOne notable example of innovation in this area is the agriculture-focused startup KisanRaja, which\ndevelops affordable technology products and IoT solutions tailored for developing nations."}, {"id": 55, "username": "oscar", "text": "Their\nflagship product offers cloud-based IoT solutions integrated with wireless sensors, mobile pump\ncontrollers, and wireless valve controllers for smart autonomous irrigation. By enabling remote\nmonitoring and control of pumps linked to a cloud server, Kisan Raja's solution facilitates efficient\nwater usage, leading to significant water savings and increased farm productivity."}, {"id": 56, "username": "oscar", "text": "Moreover, the\nadoption of such technologies not only reduces operational costs for farmers but also contributes to\nsustainable water management practices and enhanced agricultural outcomes.\nChapter 3\nML Model and Data Analysis\nFig 8: ML Model Working\nYEAR\nSTATES\nNITRATE\n(ppm)\nSULPHATE\n(ppm)\nLEAD\n(ppb)\nDATA\nSOURCE\n2021\nHaryana\n25\n120\n10\nCentral\nPollution\nControl\nBoard\n(CPCB)\nPunjab\n42\n150\n15\nUttar Pradesh\n18\n80\n5\n2022\nHaryana\n30\n135\n12\nPunjab\n45\n160\n18\nUttar Pradesh\n22\n90\n7\n2023\nHaryana\n29\n128\n8\nPunjab\n40\n170\n13\nUttar Pradesh\n20\n100\n9\nTable 7: Actual Water Quality of Last 3 Years[45]\nFACTORS\nHARYANA\nUTTAR\nPRADESH\nPUNJAB\nDATA\nSOURCE\nNITRATE\n(ppm)\n< 10\n< 10\n< 10\nIndian Council\nof Agricultural\nResearch\nAnd\nMinistry of\nAgriculture\nand Farmers\nWelfare\nSULPHATE\n(ppm)\n< 100\n< 100\n< 100\nLEAD\n(ppb)\n< 5\n(very low)\n< 5\n(very low)\n< 5\n(very low)\nTable 8: Recommended Limits by ICAR and Ministry of\nAgriculture and Farmers Welfare[48]\nANOVA (Analysis of Variance) Regression Model\nInterpretation of the results for the regression of Nitrate levels on the regions:\nFIG 9: INTERPRETATION OF NITRATE LEVELS\nRegression Equation: The simple linear regression equation based on the coefficients can be\nwritten as:\nNitrate = 28.000 + 14.333 * HaryanaPunjab - 8.000 * HaryanaUP + ε\nWhere:\n●\nNitrate: Predicted Nitrate level\n●\nHaryanaPunjab: 1 if the sample is from Haryana and 0 if from Punjab\n●\nHaryanaUP: 1 if the sample is from Haryana and 0 if from Uttar Pradesh\n●\nε: Error term\nIntercept:\n●\nThe intercept represents the expected Nitrate level when all other factors are zero."}, {"id": 57, "username": "oscar", "text": "In this\ncase, it suggests that when neither Haryana nor Punjab is considered (possibly implying\nanother reference category), the expected Nitrate level is 28.000 ppm.\nHaryanaPunjab:\n●\nThe coefficient for HaryanaPunjab suggests that, holding all other variables constant, the\nNitrate level in Haryana is expected to be 14.333 ppm higher than in Punjab.\n●\nThe coefficient is statistically significant at the 0.05 level, indicating that the difference in\nNitrate levels between Haryana and Punjab is unlikely to be due to random chance.\nHaryanaUP:\n●\nThe coefficient for HaryanaUP suggests that, holding all other variables constant, the\nNitrate level in Haryana is expected to be 8.000 ppm lower than in Uttar Pradesh.\n●\nThis coefficient is also statistically significant at the 0.05 level, indicating that the\ndifference in Nitrate levels between Haryana and Uttar Pradesh is unlikely to be due to\nrandom chance.\nUttar_Pradesh and Punjab:\n●\nThese coefficients are not defined (NA) due to singularity, possibly indicating perfect\nmulticollinearity among the predictors."}, {"id": 58, "username": "oscar", "text": "It means that the combination of Haryana, Uttar\nPradesh, and Punjab regions perfectly predicts Nitrate levels, rendering the individual\ncoefficients for Uttar Pradesh and Punjab redundant.\nModel Fit:\n●\nThe R-squared value of 0.9568 indicates that the model explains approximately\n95.68% of the variance in Nitrate levels, suggesting a very good fit.\n●\nThe adjusted R-squared value of 0.9424 also confirms the goodness of fit, considering the\nnumber of predictors in the model.\n●\nThe F-statistic of 66.48 with a p-value of 8.05e-05 indicates that the overall model is\nstatistically significant.\nInterpretation of the results for the regression of Sulphate levels on the regions:\nFIG 10: INTERPRETATION OF SULPHATE LEVELS\nRegression Equation:\nSulphate = 127.667 + 32.333 * HaryanaPunjab - 37.667 * HaryanaUP + ε\nWhere:\n●\nSulphate: Predicted Sulphate level\n●\nHaryanaPunjab: 1 if the sample is from Haryana and 0 if from Punjab\n●\nHaryanaUP: 1 if the sample is from Haryana and 0 if from Uttar Pradesh\n●\nε: Error term\n​\nIntercept:\n●\nThe intercept represents the expected Sulphate level when all other factors are zero.\nIn this context, it suggests that when neither Haryana nor Punjab is considered\n(possibly implying another reference category), the expected Sulphate level is\n127.667 ppm.\n​\nHaryanaPunjab:\n●\nThe coefficient for HaryanaPunjab suggests that, holding all other variables\nconstant, the Sulphate level in Haryana is expected to be 32.333 ppm higher than in\nPunjab.\n●\nThis coefficient is statistically significant at the 0.05 level, indicating that the\ndifference in Sulphate levels between Haryana and Punjab is unlikely to be due to\nrandom chance.\n​\nHaryanaUP:\n●\nThe coefficient for HaryanaUP suggests that, holding all other variables constant,\nthe Sulphate level in Haryana is expected to be 37.667 ppm lower than in Uttar\nPradesh.\n●\nThis coefficient is also statistically significant at the 0.05 level, indicating that the\ndifference in Sulphate levels between Haryana and Uttar Pradesh is unlikely to be\ndue to random chance.\n​\nUttar_Pradesh and Punjab:\n●\nThese coefficients are not defined (NA) due to singularity, possibly indicating\nperfect multicollinearity among the predictors."}, {"id": 59, "username": "oscar", "text": "It means that the combination of\nHaryana, Uttar Pradesh, and Punjab regions perfectly predicts Sulphate levels,\nrendering the individual coefficients for Uttar Pradesh and Punjab redundant.\n​\nModel Fit:\n●\nThe R-squared value of 0.9349 indicates that the model explains approximately\n93.49% of the variance in Sulphate levels, suggesting a very good fit.\n●\nThe adjusted R-squared value of 0.9132 also confirms the goodness of fit,\nconsidering the number of predictors in the model.\n●\nThe F-statistic of 43.09 with a p-value of 0.0002757 indicates that the overall model\nis statistically significant.\nInterpretation of the results for the regression of Lead levels on the regions:\nFIG 11: INTERPRETATION OF LEAD LEVELS\nRegression Equation:\nLead = 10.000 + 5.333 * HaryanaPunjab - 3.000 * HaryanaUP + ε\nWhere:\n●\nLead: Predicted Lead level\n●\nHaryanaPunjab: 1 if the sample is from Haryana and 0 if from Punjab\n●\nHaryanaUP: 1 if the sample is from Haryana and 0 if from Uttar Pradesh\n●\nε: Error term\n​\nIntercept:\n●\nThe intercept represents the expected Lead level when all other factors are zero."}, {"id": 60, "username": "oscar", "text": "In\nthis context, it suggests that when neither Haryana nor Punjab is considered\n(possibly implying another reference category), the expected Lead level is 10.000\nppb.\n​\nHaryanaPunjab:\n●\nThe coefficient for HaryanaPunjab suggests that, holding all other variables\nconstant, the Lead level in Haryana is expected to be 5.333 ppb higher than in\nPunjab.\n●\nThis coefficient is statistically significant at the 0.05 level, indicating that the\ndifference in Lead levels between Haryana and Punjab is unlikely to be due to\nrandom chance.\n​\n​\nHaryanaUP:\n●\nThe coefficient for HaryanaUP suggests that, holding all other variables constant,\nthe Lead level in Haryana is expected to be 3.000 ppb lower than in Uttar Pradesh.\n●\nHowever, this coefficient is not statistically significant at the 0.05 level, suggesting\nthat the difference in Lead levels between Haryana and Uttar Pradesh may be due to\nrandom chance.\n​\nUttar_Pradesh and Punjab:\n●\nThese coefficients are not defined (NA) due to singularity, possibly indicating\nperfect multicollinearity among the predictors. It means that the combination of\nHaryana, Uttar Pradesh, and Punjab regions perfectly predicts Lead levels,\nrendering the individual coefficients for Uttar Pradesh and Punjab redundant.\n​\nModel Fit:\n●\nThe R-squared value of 0.7885 indicates that the model explains approximately\n78.85% of the variance in Lead levels, suggesting a good fit.\n●\nThe adjusted R-squared value of 0.718 also suggests a reasonable fit, considering\nthe number of predictors in the model.\n●\nThe F-statistic of 11.19 with a p-value of 0.009458 indicates that the overall model\nis statistically significant.\nData prediction for the year 2024, Linear Regression Model is used:\nResults:\nChapter 4\nCONCLUSION\nOne of the main drivers of the Indian economy, the agricultural sector faces a number of\ndifficulties, including resource scarcity, climate change, population pressure, and the need for\nsustainable methods."}, {"id": 61, "username": "oscar", "text": "After analyzing agricultural practices in India, it can be concluded that water\npolicies, climate change, irregular rainfall patterns, droughts, cyclones, and storms, as well as\nfarmer access to credit and markets, distribution of subsidies, fertilizer use, and lack of knowledge,\nare the main factors affecting agricultural productivity.\nWhen the ANOVA regression model was applied to analyze the data for the states of Haryana,\nUttar Pradesh, and Punjab, it was found that, due to inadequate industrial waste management and\nimproper policy execution, Nitrate levels in the soil in Punjab were the most troubling issue. All\nthree states' nitrate levels, however, are dangerously higher than their threshold amounts.\nAs the recorded values are below the threshold, Uttar Pradesh's Sulphate levels reflect a favorable\nresult.\nLead levels in the soil have gradually decreased over time in Punjab and Haryana, indicating a\npositive departure. However, throughout the previous three years, lead levels in Uttar Pradesh have\nnot decreased.\nIndia still has a long way to go before it implements all policies in an efficient manner, and while\nthe implementation of artificial intelligence has been done on the surface levels through initiatives\nlike DeHaat and AgriApp, but their benefits are yet to reach the masses.\nREFERENCES\n[1] \"AI Technologies for Sustainable Agriculture: A Review,\" by Tuli, R., et al. (2018)\n[2] \"Sugarcane Crop Yield Forecasting Model Using Supervised Machine Learning\" by\nRamesh A. Medar, et al. (2019)\n[3] \"Use of\nInformation and Communication Technology Tools byFarmers in Anantapur\nDistrict of Andhra Pradesh,\" by Rao, PradeshJaswanth, et al. (2022)\n[4] \"IoT based SMART FARMING SYSTEM,\" by M.V.Prabhakaran, Kavitha.G (2019)\n[5] NABARD. (2020). National Mission on Agricultural Extension and Technology.\nRetrieved from https://www.nabard.org/\n[6] Vinod Chandra S.S. (2022). Role of Artificial Intelligence in Indian Agriculture: A\nReview https://arccjournals.com/journal/agricultural-reviews/R-2296\n[7]\nThakur, S., et al. (2021)."}, {"id": 62, "username": "oscar", "text": "AI-Based Technologies in Agriculture: A Comprehensive\nReview. IEEE Access, 9, 53654-53668\n[8]\nNITI Aayog. (2020). Strategy for New India @ 75: Agriculture, Food Management and\nIndustry. Retrieved from https://niti.gov.in/\n[9]\nPrakash, C., Rathor, A. S., & Thakur, G. S. M. (2013). Fuzzy-based Agriculture expert\nsystem for\nSoyabean. In International\nConference\non\nComputing\nSciences\nWILKES100-ICCS2013, Jalandhar, Punjab, India (Vol. 113)\n[10] Gupta, A., et al. (2021). Application of Artificial Intelligence in Indian Agriculture\nhttps://www.researchgate.net/publication/341736064_Application_of_Artificial_Intelligen\nce_in_Indian_Agriculture\n[11] Anurag Saxena, et al. (2020). An AI Approach to Plant Disease Detection and Diagnosis.\nJournal of Agriculture and Food Research, 2, 100033\n[12] Role of AI in transforming India’s agriculture 2021\nhttps://www.dqindia.com/role-ai-transforming-indias-agriculture/\n[13]\nAI\nin\nagriculture:\nIndia’s\nchallenges\nand\nopportunities\n2020\nhttps://indiaai.gov.in/article/ai-in-agriculture-india-s-challenges-and-opportunities\n[14] Artificial Intelligence for Pest and Disease Management in Indian Agriculture\nhttps://www.icrisat.org/artificial-intelligence-to-track-pests-and-diseases-in-india/\n[15] Government of India. (2000). National Agriculture Policy. Retrieved from English\nReleases\n[16] Government of India. (n.d.). National Mission on Sustainable Agriculture. Retrieved\nfrom https://nmsa.dac.gov.in/\n[17] Ministry of Agriculture & Farmers Welfare. (n.d.). Pradhan Mantri Fasal Bima Yojana.\nRetrieved from https://pmfby.gov.in/\n[18] Unleashing the Power of Innovation at ICRISAT: Advancing Crop Breeding with\nBreakthrough Technologies\nhttps://pressroom.icrisat.org/unleashing-the-power-of-innovation-at-icrisat-advancing-cro\np-breeding-with-breakthrough-technologies\n[19] The Role of Artificial Intelligence in Empowering Indian Farmers 2019\nhttps://timesofindia.indiatimes.com/india/how-ai-is-helping-farmers-in-indian-villages/arti\ncleshow/70360639.cms?from=mdr\n[20] Victor Mokaya (2019) Artificial Intelligence for Precision Agriculture in India\nInternational Journal of Computer Sciences and Engineering\nhttps://www.ijcseonline.org/full_paper_view.php?paper_id=3786\n[21] Zhou, K., et al. (2016) Dietary-Nutraceutical Properties of Oat Protein and Peptides\nTrends in Food Science & Technology, 56, 12-21.\nhttps://www.frontiersin.org/articles/10.3389/fnut.2022.950400/full\n[22] Jebi Sudan, Uneeb Urwat et."}, {"id": 63, "username": "oscar", "text": "al (2023) Explicating genetic architecture governing\nnutritional quality in pigmented rice https://peerj.com/articles/15901/\n[23] Nurkhalida Kamal ,Muna Abdulsalam Ilowefah et al (2022) Genesis and Mechanism of\nSome Cancer Types and an Overview on the Role of Diet and Nutrition in Cancer\nPrevention https://www.mdpi.com/1420-3049/27/6/1794\n[24] Banhisikha Debnath, Dibyajyoti Haldar et al (2021) Potential and sustainable utilization\nof tea waste: A review on present status and future trends\nhttps://www.sciencedirect.com/science/article/abs/pii/S2213343721011568\n[25] Bojan Antonić, Simona Jančíková et al (2020) Grape Pomace Valorization: A Systematic\nReview and Meta-Analysis https://www.mdpi.com/2304-8158/9/11/1627\n[26] Anne Shayene Campos,Daniel Magalhães de Oliveira et. al (2022)\nSpent Coffee\nGrounds\nCharacterization\nand\nReuse\nin\nComposting\nand\nSoil\nAmendment\nhttps://www.mdpi.com/2813-0391/1/1/2\n[27] Rosa Francaviglia ,María Almagro (2023) Conservation Agriculture and Soil Organic\nCarbon:\nPrinciples,\nProcesses,\nPractices\nand\nPolicy\nOptions\nhttps://www.mdpi.com/2571-8789/7/1/17\n[28] Axel Mie, Helle R Andersen et. al (2017) Human health implications of organic food and\norganic\nagriculture:\nA\ncomprehensive\nreview\nhttps://www.researchgate.net/publication/320630231_Human_health_implications_of_org\nanic_food_and_organic_agriculture_A_comprehensive_review\n[29]\n\"AI\nin\nagriculture:\nIndia's\nchallenges\nand\nopportunities\"\nby\nINDIAai\n(2022)\nhttps://indiaai.gov.in/article/ai-in-agriculture-india-s-challenges-and-opportunities\n[30] \"How AI is improving agriculture sustainability in India\" by Google AI (2021)\nhttps://www.aeologic.com/blog/how-ai-is-improving-agriculture-sustainability-in-india/\n[31] \"Use of AI, tech can address challenges in Indian agriculture sector, says new report\" by\nThe Economic Times (2023)\nhttps://economictimes.indiatimes.com/news/economy/agriculture/drones-can-boost-indias\n-gdp-by-up-to-1-5-address-challenges-for-the-countrys-key-agriculture-sector/articleshow\n/94943700.cms?from=mdr\n[32] Yousef Al-Saleh, Nasser M Al-Daghri et. al (2015) VITAMIN D STATUS IN SAUDI\nSCHOOL\nCHILDREN\nBASED\nON\nKNOWLEDGE\nhttps://cyberleninka.org/article/n/1313215\n[33] JAMES CHEN (2021) Agricultural Credit: Definition and Types of Credit Vehicles\nhttps://www.investopedia.com/terms/a/agricultural-credit.asp\n[34] Briefing paper 2014, Volume 4: Addressing regulatory challenges throughout the product\ndevelopment process\nhttps://www.ghtcoalition.org/resources-item/briefing-paper-volume-4-addressing-regulato\nry-challenges-throughout-the-product-development-process\n[35] DeHaat Startup https://agrevolution.in/\n[36] INDIAI- A meity initiative\nhttps://indiaai.gov.in/case-study/ai-sensors-to-make-farming-smarter\n[37] Sabrol, H., & Kumar, S. (2016). Fuzzy and neural network based tomato plant disease\nclassification using natural outdoor images. Indian Journal of Science and Technology,\n9(44), 1-8.\n[38] Rafea, A., El-Dessouki, A., Hassan, H., & Mohamed, S. (1993)."}, {"id": 64, "username": "oscar", "text": "Development and\nimplementation of a knowledge acquisition methodology for crop management expert\nsystems. Computers and electronics in agriculture, 8(2), 129-146.\n[39] Prasad R, Sinha AK & Ranjan R. 2002. KISAN: An expert system for soil nutrient\nmanagement. AFITA 2002: Asian agricultural information technology and management.\nIn Proceedings of the 3rd Asian Conference for Information Technology in Agriculture,\nBeijing, China 26-28 October, 2002, (pp. 346-353).\n[40] Prakash, C., Rathor, A. S., & Thakur, G. S. M. (2013). Fuzzy based Agriculture expert\nsystem\nfor\nSoyabean.\nIn\nInternational\nConference\non\nComputing\nSciences\nWILKES100-ICCS2013, Jalandhar, Punjab, India. DOI: 10.13140/2.1.1765.0567\n[41] Use of Artificial Intelligence in Indian Agriculture- food and scientific reports -\nhttps://foodandscientificreports.com/assets/uploads/issues/1587847062use_of_ai_in_agric\nulture.pdf\n[42] Artificial Intelligence: new technology to improve Indian Agriculture - by R Kumar, S\nYadav\n[43] Anurag Saxena: Application of Artificial Intelligence in Indian Agriculture\n[44] Data availability: Data (Nitrate, Sulphate, Lead) of all states of India is available at\nhttps://www.kaggle.com/datasets/anbarivan/indian-water-quality-data\n[45] Mahmoud Y. Shams, Ahmed M. Elshewey et. al 2023 Water quality prediction using\nmachine learning models based on grid search method, Multimedia Tools and\nApplications https://doi.org/10.1007/s11042-023-16737-4\n[46] Water Quality of Ground Water by CPCB of all states of India\nhttps://cpcb.nic.in/wqm/2022/NWMP_DATA_2022.pdf\n[47] Water Quality of Medium and Minor Rivers of all states of India\nhttps://cpcb.nic.in/wqm/2022/Water_Quality_data_of_Med_Min_River_2022.pdf\n[48] ICAR-Annual-Report-2022-23\nhttps://icar.org.in/sites/default/files/2023-07/ICAR-Annual-Report-2022-23-English.pdf\n[49]Sheshadri Chatterjee, Emerald Publishing Limited, 2020 AI strategy of India: policy\nframework, adoption challenges and actions for government\nhttps://www.emerald.com/insight/content/doi/10.1108/TG-05-2019-0031/full/html\n[50] Pushpa Singh, Narendra Singh, International Journal of Applied Evolutionary\nComputation (IJAEC) 11(4), 2020 Blockchain With IoT and AI: A Review of Agriculture\nand Healthcare https://www.igi-global.com/chapter/blockchain-with-iot-and-ai/310511\n[51]A. Subeesh, C.R. Mehta, Artificial Intelligence in Agriculture Volume 5, 2021\nAutomation and digitization of agriculture using artificial intelligence and internet of\nthings https://doi.org/10.1016/j.aiia.2021.11.004"}, {"id": 65, "username": "oscar", "text": "Software Development Engineer \nInternship Report \n \n(ES-456: Internship Report) \n \nsubmitted in partial fulfillment of the requirement  \nfor the award of the degree of \n \nBachelor of Technology \nin \nElectronics & Communication Engineering \n \nSubmitted by \n \nTanish Saini \n01320802821 \n \nUnder the supervision of \nDr. Akash Rathee \nAssistant Professor \n \n \nDepartment of Electronics & Communication \nEngineering \n \nBhagwan Parshuram Institute of Technology \nPSP-4, Sector-17, Rohini, Delhi-110089 \n \nMay/June 2025 \n \n \n \nBHAGWAN PARSHURAM INSTITUTE OF \nTECHNOLOGY \n \n \nVISION OF THE INSTITUTE \n \n●​ To establish a leading Global Center of Excellence in multidisciplinary education, \ntraining and research in the area of Engineering, Technology and Management. \n●​ To produce technologically competent, morally & emotionally strong and \nethically sound professionals who excel in their chosen field, practice \ncommitment to their profession and dedicate themselves to the service of \nmankind. \n \nMISION OF THE INSTITUTE \n \n●​ To develop world class Laboratories and other Infrastructure conducive in \nacquiring latest knowledge and expertise. \n●​ To bridge the knowledge and competency gaps of institute’s fresh pass-outs \nvis-à-vis field requirements. \n●​ To strengthen Industry- Institute Interaction and partnership for imbibing \ncorporate culture amongst our faculty and students. \n●​ To promote research culture among faculty and students enhancing their academic \nand professional confidence needed to face global challenges. To honour \ncommitment towards social and moral values \n●​ To honour commitment towards social and moral values. \n \n \n \n \n \n \n \n \n \nDepartment of Electronics and Communication Engineering, BPIT​\n​\n​\n​\nⅡ \n \nBHAGWAN PARSHURAM INSTITUTE OF \nTECHNOLOGY \n \nPROGRAM OUTCOMES (POs) \n \nPO 1.​ Engineering Knowledge: Apply knowledge of mathematics, science, \nengineering fundamentals, and an engineering specialization to the solution of \ncomplex engineering problems. \nPO 2.​ Problem Analysis: Identify, formulate, review research literature, and analyze \ncomplex engineering problems reaching substantiated conclusions using first \nprinciples of mathematics, natural sciences, and engineering sciences."}, {"id": 66, "username": "oscar", "text": "\nPO 3.​ Design/development of Solutions: Design solutions for complex engineering \nproblems and design system components or processes that meet specified \nneeds with appropriate consideration for public health and safety, and the \ncultural, societal, and environmental considerations. \nPO 4.​ Conduct Investigations of Complex Problems: Use research-based \nknowledge and research methods including design of experiments, analysis \nand interpretation of data, and synthesis of the information to provide valid \nconclusions. \nPO 5.​ Modern Tool Usage: Create, select, and apply appropriate techniques, \nresources, and modern engineering and IT tools including prediction and \nmodeling to complex engineering activities with an understanding of the \nlimitations. \nPO 6.​ The Engineer and Society: Apply reasoning informed by the contextual \nknowledge to assess societal, health, safety, legal and cultural issues and the \nconsequent responsibilities relevant to the professional engineering practice. \nPO 7.​ Environment and Sustainability: Understand the impact of the professional \nengineering solutions in societal and environmental contexts, and demonstrate \nthe knowledge of, and need for sustainable development. \nPO 8.​ Ethics: Apply ethical principles and commit to professional ethics and \nresponsibilities and norms of the engineering practice \n \nPO 9.​ Individual and Team Work: Function effectively as an individual, and as a \nmember or leader in diverse teams, and in multi-disciplinary settings. \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\nIII \n \nPO 10.​Communication: Communicate effectively on complex engineering activities \nwith the engineering community and with society at large, such as, being able \nto comprehend and write effective reports and design \ndocumentation, make effective presentations, and give and receive clear \ninstructions. \nPO 11.​Project \nManagement \nand \nFinance: \nDemonstrate \nknowledge \nand \nunderstanding of the engineering and management principles and apply these \nto one’s own work, as a member and leader in a team, to manage projects and \nin multi-disciplinary environments."}, {"id": 67, "username": "oscar", "text": "\nPO 12.​Life-long Learning: Recognize the need for, and have the preparation and \nability to engage in independent and life-long learning in the broadest context \nof technological change. \n \nCOURSE OUTCOMES (COs) \n \nCO1. Apply engineering knowledge and modern tools to real-world industrial \nproblems during the internship. \nCO2. Analyze organizational structures, technical processes, and identify areas of \nimprovement or innovation. \nCO3. Communicate internship outcomes effectively through professional  reports and \npresentations. \nCO4. Demonstrate ethical conduct, teamwork, and understanding of the broader  \nsocietal and environmental impact of engineering practice. \n \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\nIV \n \nBHAGWAN PARSHURAM INSTITUTE OF TECHNOLOGY \n \nSUSTAINABLE DEVELOPMENT GOALS (SDGs) \n \nSDG 1 \nNO POVERTY \nSDG 2 \nZERO HUNGER \nSDG 3 \nGOOD HEALTH & WELL-BEING \nSDG 4 \nQUALITY EDUCATION \nSDG 5 \nGENDER EQUALITY \nSDG 6 \nCLEAN WATER & SANITATION \nSDG 7 \nAFFORDABLE & CLEAN ENERGY \nSDG 8 \nDECENT WORK & ECONOMIC GROWTH \nSDG 9 \nINDUSTRY, INNOVATION & INFRASTRUCTURE \nSDG 10 \nREDUCED INEQUALITIES \nSDG 11 \nSUSTAINABLE CITIES & COMMUNITIES \nSDG 12 \nRESPONSIBLE CONSUMPTION & PRODUCTION \nSDG 13 \nCLIMATE ACTION \nSDG 14 \nLIFE BELOW WATER \nSDG 15 \nLIFE ON LAND \nSDG 16 \nPEACE & JUSTICE STRING INSTITUTIONS \nSDG 17 \nPARTNERSHIPS FOR THE GOALS \n \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n V \n \n ELECTRONICS & COMMUNICATION ENGINEERING  \n \n \nVISION OF THE DEPARTMENT \n●​ To emerge as a center of excellence producing globally competent and morally \nsound professionals in the field of Electronics & Communication Engineering \nwho will practice commitment to their profession and dedicate themselves to \nthe service of mankind. \nMISION OF THE DEPARTMENT \n●​ To develop state-of-the-art laboratories providing relevant practical inputs to \nstudents. \n●​ To provide strong knowledge base to students in the area of Electronics & \nCommunication Engineering, and to train them as per requirement of \nindustries and research organizations."}, {"id": 68, "username": "oscar", "text": "\n●​ To facilitate institute industry interaction to the benefit of stake holders and to \nmotivate teachers for continuous improvement of their academic standards. \n \n \nPROGRAM EDUCATIONAL OBJECTIVES (PEOs) \nPEO 1: Graduate will have the fundamental and advance knowledge in Mathematics, \nScience, Electronics & Communication Engineering and design methodologies to \nsuccessfully accomplish their professional career in industry as an Engineer, \ntheoretically practically, in the field of Electronics & Communication Engineering, or \nbecome an entrepreneur. \nPEO 2: Graduate will have strong fundamental knowledge in specialized areas of \nElectronics & Communication Engineering to contribute towards research and \ndevelopments through paper publications, projects and pursue higher studies in their \nspecialized fields. \nPEO 3: Graduate shall learn all interpersonal skills and inculcate sense of social \nresponsibilities and environmental concerns so as to make them good leaders and \ncitizen. \n \nDepartment of Electronics and Communications Engineering,BPIT​\n​\n​\n​\nVI \n \nPROGRAM SPECIFIC OUTCOMES (PSOs) \n \nPSO 1: Students will have proficiency in grasping fundamental principles of \nElectronics & Communication Engineering and effectively applying them across \ndiverse domains, including Semiconductors, Communications, Signal processing, \nAntennas, Networking, VLSI, Embedded systems, and becoming adept in the latest \ntools and methodologies employed in both research and industry \n \nPSO 2: Student will foster critical thinking to evaluate engineering issues pertinent to \nElectronics & Communication Engineering through the cultivation of profound \nexpertise and skills in the realms of fundamental sciences, engineering mathematics, \nand core engineering principles, enabling the resolution of intricate engineering \ndilemmas. \n \nPSO 3: Student will be able to acquire the skill to conduct independent research, seek \ninnovative solutions, and make contributions to the progress of knowledge in \nspecialized areas of electronics and communication engineering."}, {"id": 69, "username": "oscar", "text": "Adhere to ethical \nprinciples in engineering practice, research, and innovation, while exemplifying a \nsteadfast dedication to integrity, social responsibility, and sustainable development \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDepartment of Electronics and Communications Engineering,BPIT​\n​\n​\n​\nVII \n \nCO–PO MAPPING TABLE \n \nPO1 \nPO2 \nPO3 \nPO4 \nPO5 \nPO6 \nPO7 \nPO8 \nPO9 PO10 PO11 PO12 \nCO1 \n3 \n2 \n2 \n1 \n3 \n1 \n1 \n1 \n1 \n1 \n2 \n2 \nCO2 \n2 \n3 \n2 \n2 \n2 \n2 \n0 \n0 \n2 \n1 \n2 \n2 \nCO3 \n1 \n1 \n1 \n0 \n1 \n0 \n0 \n1 \n2 \n3 \n2 \n1 \nCO4 \n0 \n0 \n0 \n0 \n0 \n2 \n2 \n3 \n3 \n2 \n2 \n2 \n \nJUSTIFICATION FOR CO–PO MAPPING \nCO1: Apply engineering knowledge and tools in real-world problems \n●​ PO1: Strong use of engineering fundamentals in industrial settings. \n●​ PO2–PO4: Students analyze, investigate, and often assist in developing or \nimproving systems. \n●​ PO5: Interns frequently use modern tools like software, automation, and \ninstrumentation. \n●​ PO6–PO8: Ethical and social aspects have some consideration in industrial \npractices. \n●​ PO9–PO10: Interpersonal and reporting skills are essential. \n●​ PO11: Understanding of basic project or operations management is expected. \n●​ PO12: Exposure encourages self-directed learning and upskilling. \nCO2: Analyze processes and propose improvements \n●​ PO1–PO3: Application of knowledge to understand and optimize real-world \nsystems. \n●​ PO4: Direct involvement in observation, investigation, and analysis of \nsystems. \n●​ PO5: Use of technical tools for data collection or process mapping. \n●​ PO6: Reflection on societal/industrial impact. \n●​ PO9–PO11: Team and system-level understanding is needed for improvement \nsuggestions. \n●​ PO12: Critical thinking fosters lifelong learning. \nCO3: Communicate internship work professionally \n●​ PO1–PO2: Applies existing engineering principles for documentation and \ncommunication. \n●​ PO3: Limited but relevant when documenting findings. \n●​ PO5: Use of presentation/reporting software. \n●​ PO8: Ethical standards in report writing and data use."}, {"id": 70, "username": "oscar", "text": "\n●​ PO9: Team interaction helps in forming clear communication \nDepartment of Electronics and Communications Engineering,BPIT​\n​\n​\n​\nVIII \n \n●​ PO10: Strong emphasis on writing and presenting the report. \n●​ PO11–PO12: Involves planning and iterative refinement \nCO4: Ethics, teamwork, sustainability \n●​ PO6: Projects often affect or reflect societal needs. \n●​ PO7: Environmental sustainability can be a key consideration. \n●​ PO8: Ethical behavior and compliance with codes of conduct are crucial. \n●​ PO9: Team-based environments emphasize collaboration. \n●​ PO10–PO12: Required communication and ongoing growth. \nCO–PSO MAPPING TABLE \nPO1 \nPO2 \nPO3 \nCO1 \n3 \n3 \n1 \nCO2 \n2 \n3 \n2 \nCO3 \n1 \n1 \n1 \nCO4 \n1 \n2 \n2 \n \nJUSTIFICATION FOR CO–PSO MAPPING \nCO1: Apply engineering knowledge and tools in real-world problems \n●​ Students will apply fundamental ECE principles and modern tools to practical \nproblems, which aligns with domains such as Semiconductors, Signal \nProcessing, VLSI, etc. (PSO1) \n●​ They often work with fundamental of ECE principles and modern tools to \npractical problems, which align with domains such as Semiconductors, Signal \nProcessing, VLSI, etc. \n●​ Exposure to modern technologies in applied settings (PSO3) is typical in \nmany internships. \nCO2: Analyze processes and propose improvements \n●​ Analyzing engineering processes and identifying improvements requires \ncritical thinking and deep understanding of core engineering principles.(PSO2) \n●​ These are relevant, as proposing improvements often involve innovation, \nresearch-oriented thinking, and ethical considerations in implementation. \n(PSO1, PSO3) \nCO3: Communicate internship work professionally \nDepartment of Electronics and Communications Engineering,BPIT​\n​\n​\n​\nIX \n \n●​ Communicating tech outcomes may involve documenting designs, \nenvironments, or tools used — but only indirectly, so the relationship is weak. \nCO4: Ethics, teamwork, sustainability \n●​ It emphasizes on ethical principles, social responsibility, sustainable \ndevelopment, and integrity in engineering practice. Teamwork is also \ninherently part of responsible research and innovation."}, {"id": 71, "username": "oscar", "text": "(PSO2, PSO3) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDepartment of Electronics and Communications Engineering,BPIT​\n​\n​\n​\nX \n \nINTERNSHIP TO SDG MAPPING \n \nSUSTAINABLE DEVELOPMENT GOALS \n(1/2/3/4/5/6/7/8/9/10/11/12/13/14/15/16/17) \nInternship \nProject \nSDG8 , SDG9 \n \nJustification for SDG mapped. \n●​ SDG 8 – Decent Work and Economic Growth:​\n As a full-time intern, I worked on live projects that supported enterprise \nbusiness solutions. This hands-on experience strengthened my employability, \nencouraged productive work habits, and aligned with the goal of promoting \ndecent work for youth. \n●​ SDG 9 – Industry, Innovation, and Infrastructure:​\n My project work involved developing scalable backend systems using \nNode.js, Express.js, and Apache Camel. These contributions supported digital \ninfrastructure and encouraged innovation in industry-oriented software \nsolutions.​\n \n \n \n \n \n \n \n \n \nDepartment of Electronics and Communications Engineering,BPIT​\n​\n​\n​\nXI \n \n \nDECLARATION \nThis is to certify that the material embodied in this Internship Report titled “Software \nDevelopment Engineer Internship Report” being submitted in the partial fulfillment of \nthe requirements for the award of the degree of Bachelor of Technology in Electronics \nand Communication Engineering is based on my original work. It is further certified \nthat this Internship work has not been submitted in full or in part to this university or \nany other university for the award of any other degree or diploma. My indebtedness to \nother works has been duly acknowledged at the relevant places. \n \n ​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n(Tanish Saini) \n01320802821 \n \n ​\n​\n​\n​\n       \n \n \n \n \n \n \n \n \nDepartment of Electronics and Communications Engineering,BPIT​\n​\n​\n​\nXII \n \nCERTIFICATE FROM THE COMPANY \n  \nThis is to certify that Tanish Saini (01320802821) has undertaken an internship at \nXceedance Consulting India Pvt. Ltd., 4th Floor, Plot No. 2, Tower 5, Candor Tech \nSpace, Sector-62, Noida, Gautam Buddha Nagar, Uttar Pradesh, 201309 from \n20/01/2025 to 27/06/2025 under the supervision and guidance of Mr. Vihaan Mahato, \nQA Architect. \n \n \n  \n \n \n(Mr."}, {"id": 72, "username": "oscar", "text": "Vihaan Mahato) \nQA Architect \nXceedance Consulting India Pvt. Ltd. \n​\n​\n​\n​\n \n  \n \n ​\n \n \nDepartment of Electronics and Communications Engineering,BPIT​\n​\n​\n​\nXIII \n \nCERTIFICATE FROM THE INSTITUTE \n  \nThis is to certify that the work embodied in this Internship Report titled “Xceedance \nInternship Report” being submitted in the partial fulfillment of the requirements for \nthe award of the degree of Bachelor of Technology in Electronics and Communication \nEngineering, is original and has been carried out by Tanish Saini (01320802821) \nunder my supervision and guidance. \n \nIt is further certified that this Internship work has not been submitted in full or in part \nto this university or any other university for the award of any other degree or diploma \nto the best of my knowledge and belief. \n  \n \n \n(Dr. Akash Rathee)​ ​\n​\n​\n​\n​\n (Mr. Sanjay Dureja) \nAssistant Professor​\n​\n​\n​\n​\n​\n Sr. Manager (TnP) \n  \n \n ​\n \n(Prof. Rajiv Sharma) \nHOD – ECE \nBhagwan Parshuram Institute of Technology \n \n \n \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\nXIV \n \nACKNOWLEDGEMENT \n \nAn endeavor is not complete and successful till the people who made it possible are \ngiven due credit for making it possible. I take this opportunity to thank all those who \nhave made the endeavor successful for me. \n \nAt the very onset I thank Mr. Vihaan Mahato, my Internship supervisor for giving \ninspiration on such important and valuable topics, his scholarly guidance, constant \nsupervision and encouragement to make it success. His knowledge and passion for \nproblem solving amazes and inspires me. At all crucial stages, valuable insights given \nby him, made me take the right direction. I thank him for the countless hours he has \nspent with me, criticizing my ideas, enlightening my writing skills, and helping me. \nHis assistance during this work has been invaluable and inspirational."}, {"id": 73, "username": "oscar", "text": "\n \nI extend my thanks to Prof. Payal Pahwa, Principal, BPIT, Prof. Rajiv Sharma, \nHOD-ECE, BPIT and Mr. Sanjay Dureja, Sr. Manager (TnP),  BPIT for their regular \nmotivation, support and full presence. \n \nLast but not least, I especially thank my family members for their unconditional moral \nsupport, encouragement, best wishes and patience for not giving them proper time \nduring the study. \n \n \n(Tanish Saini) \n01320802821 \n \n \n \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\nXV \n \n \nAbstract \n \nThis report presents a detailed account of my internship at Xceedance, a global \nprovider of technology services and solutions for the insurance industry. Conducted \nover a five-month period from January 20, 2025, to June 27, 2025, at the Noida \nbranch, the internship offered me a comprehensive learning experience in full-stack \ndevelopment within a real-world corporate setting. As an Associate Programmer in \nthe Technology Department, I was exposed to a variety of front-end and back-end \ntechnologies including Angular, React, Node.js, Spring Boot, and Prisma. \nThe internship was structured in two main phases: an intensive training period and a \nhands-on project phase. During the initial months, I underwent structured training in \nJava Full-Stack Development, which included both theoretical knowledge and \npractical assignments. This was followed by active involvement in internal projects, \nwhere I contributed to building and maintaining applications, debugging issues, and \nimproving development workflows. \nThe report details my responsibilities, the tools and platforms I engaged with, \nchallenges encountered, and the solutions I applied. It also highlights my personal \ngrowth in terms of technical proficiency, problem-solving abilities, collaboration, and \ncommunication. Suggestions for improving the internship program are provided based \non my firsthand experience. Overall, this internship served as a bridge between \nacademic knowledge and industry practices, significantly enhancing my professional \npreparedness."}, {"id": 74, "username": "oscar", "text": "\n \n \n \n \n \n \n \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\nXVI \n \nTABLE OF CONTENTS \n \n \nVision and Mission of the Institute​\n​\n​\nII \nProgram Outcomes (POs)​\n​\n​\nIII \nDepartment’s Vision, Mission, PEOs and PSOs​\n​\n​\nV \nCO-PO Mapping                                                                                            VIII \nInternship to SDG Mapping​\n​\n​\nXI \nDeclaration​\n​\n​\nXII \nCertificate from the Company​\n​\n​\nXIII \nCertificate from the Institute​\n​\n​\nXIV \nAcknowledgement​\n​\n​\nXV \nAbstract​\n​\n​\nXVI \n \nChapter 1:  Introduction of the Company​\n​\n​\n18 \n              1.1: About the Company \n              1.2: Profile of the Company  \nChapter 2:  Introduction of the Internship​\n​\n​\n21 \n             2.1: About the Internship \n             2.2: Objectives of the Internship \n             2.3: Roles and Responsibilities \nChapter 3:  Internship Activities​\n​\n​\n25 \n             3.1: Task Description \n             3.2: Tools / Technologies / Platform used \n             3.3: Technical Application \n             3.4: Challenges Faced \nChapter 4:  Contribution to the Organization​\n​\n​\n31 \nChapter 5: Learning and Development​\n​\n​\n33 \nChapter 6: Summary and Conclusion​\n​\n​\n37 \nChapter 7: Suggestions for the Improvement​\n​\n​\n40 \nBibliography​\n​\n​\n43 \n \nDepartment of Electronics and Communication Engineering, BPIT​\n​\n​\n        XVII \n \nCHAPTER 1: Introduction of the Company \n \n \n \n1.1 About the Company \nXceedance is a global consulting, technology, and managed services company that \nspecializes in providing end-to-end solutions for insurance organizations. Founded in \n2013, the company has rapidly grown to become a trusted partner for insurers, \nreinsurers, managing general agents (MGAs), brokers, and startups within the global \ninsurance ecosystem. Headquartered in Worcester, Massachusetts, USA, Xceedance \nhas established a strong global footprint with operations in North America, Europe, \nAsia Pacific, and Australia, with delivery centers in cities such as Gurgaon (India), \nKrakow (Poland), and London (UK)."}, {"id": 75, "username": "oscar", "text": "\nThe company’s vision is to catalyze innovation and transformation in the insurance \nindustry by delivering strategic services that enhance efficiency, support intelligent \nautomation, and improve customer experiences. With a mission to help insurance \norganizations operate more efficiently and adapt to dynamic market demands, \nXceedance offers an expansive range of services across the insurance value chain. \nThese include underwriting support, actuarial services, catastrophe modeling, policy \nservices, claims management, product development, finance and accounting, and \ncutting-edge technology solutions. \nXceedance is recognized for its deep domain expertise and data-driven approach, \nenabling clients to improve operational performance, reduce costs, and accelerate \ndigital transformation. By leveraging advanced technologies like artificial intelligence \n(AI), machine learning (ML), robotic process automation (RPA), and data analytics, \nXceedance helps insurance organizations modernize their workflows and make \nbetter-informed decisions. \nThe company is structured around a partnership-driven model, placing strong \nemphasis on collaboration, customization, and long-term value creation. It follows a \nconsultative approach, taking time to understand the client’s unique challenges before \ndesigning tailor-made solutions. This strategic engagement model has earned \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n18 \n \nXceedance numerous accolades and long-term relationships with industry leaders \naround the globe. \nA key differentiator for Xceedance is its commitment to continuous innovation and \ninvestment in its people. The company fosters a culture that promotes learning, \nownership, and excellence. With over 3,000 professionals worldwide, Xceedance \nboasts a diverse workforce with strong technical capabilities and a shared passion for \ndelivering value. Its values—Integrity, Collaboration, Ownership, Respect, and \nPersistence—form the foundation of its organizational culture and guide its \ninteractions with clients and employees alike. \nXceedance has received significant recognition in recent years. It was named a \n‘Leader’ in ISG’s 2024 Insurance Services Report for Property and Casualty (P&C) \nInsurance BPO Services in North America."}, {"id": 76, "username": "oscar", "text": "Additionally, it was honored with the title \nof “Best Service Provider – Claims” at the Insurance Business Australia Awards 2024. \nThese achievements reflect the company’s relentless commitment to service \nexcellence and industry leadership. \nAs the insurance industry continues to evolve in response to changing consumer \nexpectations, regulatory requirements, and technological advancements, Xceedance \nremains at the forefront of driving innovation. Its comprehensive service offerings, \nglobal delivery capabilities, and strong customer-centric ethos position it as a valuable \npartner for any organization looking to transform its insurance operations for the \ndigital age. \n \n1.2 Profile of the Company \nXceedance Consulting India Pvt. Ltd., established in 2013, is a global provider of \nstrategic operations support, technology, and data services tailored for the insurance \nindustry. With its headquarters in Worcester, Massachusetts, USA, Xceedance has \nexpanded its footprint across multiple countries, including India, the United Kingdom, \nPoland, Australia, and Canada. The company's Indian operations are spread across \nseveral cities, with significant offices in Gurugram, Bengaluru, Pune, and Noida. \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n19 \n \nThe Noida branch, located at Candor Techspace, 12th Floor, Tower 3, Block B, \nIndustrial Area, Sector 62, Noida 201309, serves as a pivotal center for the company's \ntechnological and operational endeavors. This office is instrumental in delivering a \nrange of services that encompass the entire insurance lifecycle. \nKey Functional Areas at the Noida Branch: \n●​ Technology & Digital Solutions: The Noida office is a hub for developing \nadvanced technology solutions that cater to the evolving needs of the \ninsurance sector. This includes application development, system integration, \nand the deployment of innovative digital tools. ​\n \n●​ Data & Analytics: Leveraging data-driven insights, the team focuses on \nenhancing decision-making processes for clients."}, {"id": 77, "username": "oscar", "text": "This involves data \nmanagement, predictive analytics, and the implementation of AI/ML models \nto streamline operations.​\n \n●​ Lifecycle & Operations Support: The branch provides comprehensive support \nacross various stages of the insurance lifecycle, including underwriting, policy \nadministration, claims processing, and finance & accounting services.​\n \n●​ Consultancy & Advisory Services: Offering strategic guidance, the Noida \nteam assists clients in navigating complex challenges, optimizing processes, \nand implementing best practices to achieve operational excellence.​\n \nThe Noida office embodies Xceedance's commitment to fostering a culture of \ninnovation, collaboration, and continuous learning. Employees are encouraged to \nengage in cross-functional projects, participate in leadership development programs, \nand contribute to the company's mission of transforming the insurance industry \nthrough intelligent solutions. During my internship at the Noida branch, I was part of \nthe Technology department, working under the guidance of Mr. Vihaan Mahato, a QA \nArchitect. This experience provided me with valuable insights into the company's \noperations and its dedication to delivering high-quality services to clients worldwide \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n20 \n \nCHAPTER 2: Introduction of the Internship \n \n \n2.1 About the Internship \nMy internship at Xceedance began on 20th January 2025 and concluded on 27th June \n2025, spanning a comprehensive period of five months. It was a full-time, in-person \ninternship at the company’s Noida branch and was offered to me through a campus \nplacement drive organized by my university. The internship was a paid position, \nwhich reflected the company’s professional commitment toward recognizing the value \nof its interns and investing in early talent. The experience served as a bridge between \nacademic learning and industry exposure, helping me understand how software \ndevelopment is executed in a structured corporate environment."}, {"id": 78, "username": "oscar", "text": "\nAt the beginning of the internship, the organization provided structured and intensive \ntraining in Java Full Stack Development, which laid the groundwork for the practical \nassignments and project work that followed. The training included a focused \ncurriculum in Angular for building dynamic front-end interfaces, and Spring Boot for \ndeveloping scalable and efficient backend services. During this training phase, I also \nlearned how to build and consume RESTful APIs, manage application states, and \nintegrate front-end and back-end systems effectively. This phase ensured that interns \nlike me were adequately prepared before being assigned to live projects. \nFollowing the initial training period, I transitioned into working with a dedicated \nproject team within the technology department. I had the opportunity to contribute to \nin-house development projects that utilized a different tech stack—primarily React.js \nfor the frontend, Node.js and Express.js for the backend, along with Prisma ORM for \ndatabase interactions and MySQL as the relational database system. This diversity in \ntechnologies allowed me to build flexibility in adapting to new frameworks and tools \nand gave me hands-on experience in managing different stages of the software \ndevelopment lifecycle. \nOverall, the internship at Xceedance was not just a learning experience but also a \nperiod of professional transformation. It helped bridge the gap between theoretical \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n21 \n \nconcepts and their practical implementation, giving me insights into working within a \nprofessional development environment. It also provided me with a broader \nunderstanding of how different roles within a tech team collaborate toward a common \ngoal, and how technology is used to solve real problems in the insurance domain. \n \n2.2 Objectives of the Internship \nThe primary objective of my internship at Xceedance was to gain hands-on industry \nexperience and apply the theoretical concepts learned during my academic \ncoursework in a real-world setting."}, {"id": 79, "username": "oscar", "text": "The internship was carefully designed to provide \nexposure to the software development lifecycle (SDLC), current industry practices, \nand advanced tools and technologies used in enterprise-grade solutions—particularly \nwithin the insurance and insurtech domain where Xceedance operates. \nAt a foundational level, the internship aimed to develop my proficiency as a full-stack \ndeveloper, beginning with intensive training and gradually transitioning into \nmeaningful contributions to real projects. The structured training phase focused on \nimparting practical knowledge in Java Full Stack Development, including key \nframeworks such as Angular for building responsive web interfaces and Spring Boot \nfor developing secure and scalable backend services. This was not limited to theory \nbut involved daily hands-on labs, assignments, and collaborative coding exercises \nwhich deepened my understanding of frontend-backend integration and full-cycle \napplication development. \nAnother critical objective was to familiarize interns with the corporate working \nenvironment, particularly in how modern Agile teams function. From sprint planning \nand daily stand-ups to task tracking via Jira and knowledge management through \nConfluence, the goal was to make interns industry-ready not only in terms of \ntechnology but also in terms of team dynamics, communication, accountability, and \ntime management. We were taught how to effectively participate in discussions, raise \ntickets, respond to QA feedback, and follow structured development pipelines using \ntools like Git and GitHub for version control and CI/CD integrations. \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n22 \n \nIn summary, the internship’s objectives were multifaceted. They spanned from \ngaining technical competency and understanding the workings of a corporate IT setup, \nto improving soft skills and experiencing agile project delivery."}, {"id": 80, "username": "oscar", "text": "These goals were \nthoughtfully set by Xceedance to ensure that interns leave the program not only with \nimproved coding abilities but also with a strong sense of professional discipline, \nworkplace ethics, and the confidence to take on more complex responsibilities in the \nfuture. \n \n2.3 Roles and Responsibilities \nDuring my internship at Xceedance, I worked in the Technology Department as an \nAssociate Programmer. My role was dynamic and evolved over the course of the \ninternship, beginning with a learning phase and transitioning into more active \nparticipation in project development. As part of a structured internship program, my \nresponsibilities were tailored to gradually build my technical and professional \ncompetence while ensuring meaningful contributions to the team and organization. \nInitially, my primary responsibility was to actively participate in the Java Full Stack \nDeveloper training program provided by the company. This included daily sessions on \nAngular, TypeScript, HTML/CSS, and Java, along with backend frameworks such as \nSpring and Spring Boot. I was required to complete coding assignments, participate in \nquizzes, and submit weekly evaluations based on the modules covered. This period \nalso included individual and group tasks focused on developing mini-projects that \nsimulated real-world business applications. \nAs I progressed, my role expanded into contributing to internal web application \ndevelopment projects. I joined a team working on in-house solutions using the MERN \n(MongoDB, Express, React, Node.js) and PERN (PostgreSQL/Prisma, Express, \nReact, Node.js) stacks. Under the guidance of my mentor and supervisor, Mr."}, {"id": 81, "username": "oscar", "text": "Vihaan \nMahato, I was entrusted with tasks such as: \n●​ Designing and developing frontend components using React.js and integrating \nthem with backend APIs.​\n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n23 \n \n●​ Creating responsive UI layouts using Tailwind CSS, Material UI, and \nBootstrap based on mockups provided by the design team.​\n \n●​ Developing RESTful APIs using Node.js and Express, and ensuring seamless \ninteraction between frontend and backend layers.​\n \n●​ Writing and optimizing database queries using Prisma ORM and connecting to \nrelational databases such as MySQL and PostgreSQL.​\n \n●​ Debugging and resolving bugs and performance issues encountered during \ntesting.​\n \n●​ Using Git and GitHub for version control, including handling pull requests, \nbranching, and merging workflows.​\n \n●​ Participating in daily stand-up meetings, sprint planning, and retrospectives as \npart of the Agile development lifecycle.​\n \nBeyond direct coding responsibilities, I was also expected to work closely with QA \nengineers, designers, and fellow interns to ensure feature parity and quality assurance. \nI was responsible for writing unit tests using frameworks like Jest and Mocha, as well \nas performing code reviews for peers when requested. This was an important \nresponsibility that not only improved my understanding of clean code practices but \nalso helped build a team-oriented mindset. \nOverall, my roles and responsibilities were carefully aligned to ensure growth, \ncontribution, and engagement throughout the internship. I was given the opportunity \nto learn, apply, and evolve — all within a professional environment that fostered \ncollaboration, innovation, and accountability. These experiences not only enriched my \ntechnical toolkit but also instilled valuable workplace habits and a strong sense of \nprofessional responsibility that I will carry forward into my future career."}, {"id": 82, "username": "oscar", "text": "\n \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n24 \n \nCHAPTER 3: Internship Activities \n \n \n3.1 Task Description \nThroughout my internship at Xceedance, I was entrusted with a range of tasks that \nspanned both learning and practical application. My responsibilities evolved from \nintensive training assignments to contributing to live in-house projects under the \nmentorship of my supervisor, Mr. Vihaan Mahato, a QA Architect in the Tech \nDepartment. \nTraining Phase \nIn the initial phase, my focus was on strengthening core programming skills through \nstructured Java Full Stack Developer training. I worked on: \n●​ Frontend development using Angular, along with HTML, CSS, and \nTypeScript.​\n \n●​ Backend APIs with Java and Spring Boot, implementing standard CRUD \noperations.​\n \n●​ Hands-on mini-projects such as a student management portal and a simple task \ntracker.​\n \n●​ Learning integration of frontend and backend using RESTful services.​\n \nEach module included assessments and short projects to reinforce theoretical concepts \nand simulate real development tasks. \nProject Phase \nAs training concluded, I was assigned to assist on internal projects using a more \nmodern tech stack involving React, Node.js, Express, Prisma, and MySQL. Key \nresponsibilities included: \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n25 \n \n●​ Building frontend components using React with Hooks and Context API.​\n \n●​ Creating and integrating backend APIs using Express and Node.​\n \n●​ Writing Prisma ORM queries and managing database schema and migrations.​\n \n●​ Debugging and optimizing existing code for improved performance and \nusability.​\n \nCollaborative Tasks \nI actively contributed to Agile sprints, participated in daily stand-up meetings, and \nused Jira for task tracking. Version control was handled using GitHub, where I \nsubmitted pull requests, reviewed code, and collaborated with teammates. I also \nassisted in documentation and unit testing using tools like Jest and Postman."}, {"id": 83, "username": "oscar", "text": "\nConclusion \nThese tasks gave me hands-on exposure to the full software development \nlifecycle—right from development to testing and deployment. It allowed me to gain \nreal-world insights into working as part of a tech team in a corporate environment. \n \n3.2 Tools / Technologies / Platform Used \nDuring my internship at Xceedance, I worked with a range of tools and technologies \nessential for full-stack web development. These tools supported both training and \nreal-world project work and enhanced my understanding of the modern development \nenvironment. \nFrontend Technologies \n●​ Angular: Used extensively during training for building SPAs using \ncomponents, services, and routing.​\n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n26 \n \n●​ React.js: Applied in live projects for creating dynamic UI using Hooks and \nContext API.​\n \n●​ HTML5, CSS3, JavaScript, TypeScript: Formed the foundation of web \ndevelopment tasks.​\n \n \nBackend Technologies \n●​ Java & Spring Boot: Used in training to build RESTful APIs with layered \narchitecture.​\n \n●​ Node.js & Express.js: Used in live projects to develop backend services and \nroute APIs.​\n \nDatabases & ORM \n●​ MySQL: Employed for data storage and query operations in both training and \nprojects. \n●​ Prisma ORM: Used to interact with the database in Node.js projects using \nschema models. \n●​ Hibernate ORM: Used to interact with the database in Java projects using \nschema models and provide abstraction for sql queries.​\n \nDevelopment Tools \n●​ VS Code and Eclipse: Primary IDEs for writing, debugging, and testing code. \n●​ Postman: Used for API testing. \n●​ Git & GitHub: For version control, collaborative coding, and managing pull \nrequests."}, {"id": 84, "username": "oscar", "text": "\n●​ Jira: For task tracking and sprint management.​\n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n27 \n \nCommunication & Platforms \n●​ Slack, Microsoft Teams: For daily team communication and meetings.​\n \n●​ Windows OS: My main development environment.​\n \n●​ Chrome Developer Tools: Used for frontend debugging and layout testing.​\n \nThese tools and platforms were integral to my learning process and helped me \nbecome comfortable with professional development workflows. \n3.3 Technical Application \nMy internship at Xceedance provided me with multiple opportunities to apply \ntechnical concepts in real-world scenarios. From the structured training phase to \ncontributing to in-house development projects, I used my programming knowledge \nand problem-solving skills across both the frontend and backend of web applications. \nFrontend Implementation \nUsing Angular during training, I developed dynamic user interfaces involving \ncomponent-based design, two-way data binding, and modular architecture. I created \nfeatures like login pages, form validations, and dashboard layouts. When I \ntransitioned to live projects, I worked extensively with React.js, where I applied \nconcepts like state management using Hooks and data flow through props and \ncontext. I also made use of modern UI libraries like Material UI and Tailwind CSS to \nensure responsive and professional user interfaces. \n \nBackend Development \nIn the backend, I used Java with Spring Boot to build RESTful APIs during training, \napplying the MVC architecture and using annotations for dependency injection and \nservice management. Later, for live projects, I worked with Node.js and Express.js to \ndesign backend routes, process HTTP requests, and connect with databases. I also \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n28 \n \nhandled API testing using Postman to ensure proper request/response handling and \nerror management. \nDatabase Integration \nUsing MySQL in both the training and project phases, I performed basic CRUD \noperations, created relational schemas, and wrote optimized queries."}, {"id": 85, "username": "oscar", "text": "With Prisma \nORM, I interacted with the database more efficiently by defining models in a schema \nfile and using type-safe queries in Node.js applications. \nVersion Control & Collaboration \nI regularly pushed code to GitHub repositories, submitted pull requests, and worked \non team branches. These practices reinforced my understanding of version control and \nteam-based development. I participated in code reviews and followed commit \nconventions, which enhanced my coding discipline and team communication. \nAgile Environment \nThe internship followed an Agile methodology. I participated in daily stand-ups, \nsprint planning, and retrospectives using Jira for task tracking. This taught me how to \nprioritize work, break down features into deliverables, and align individual \ncontributions with team goals. \n \n3.4 Challenges Faced \nWhile my internship at Xceedance was an enriching learning experience, it also \npresented several challenges that tested my technical skills, adaptability, and ability to \nwork in a corporate environment. These challenges helped me grow and taught me \nhow to approach problems in a structured, solution-oriented manner. \n1. Adapting to New Technologies \nOne of the earliest challenges was quickly learning and adapting to a variety of tools \nand frameworks. While I had some academic exposure to web development, working \nwith Angular, React, Node.js, and Spring Boot in a professional setting required a \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n29 \n \nmuch deeper understanding. I often had to revisit documentation, follow tutorials \noutside work hours, and seek guidance from peers to catch up. \n2. Debugging Complex Codebases \nDuring project assignments, I worked with existing codebases that involved complex \nlogic and modular structures. Initially, understanding the flow of data and logic in \nReact components and Express routes was overwhelming. Navigating unfamiliar files \nand debugging multi-layered issues required patience and a logical approach."}, {"id": 86, "username": "oscar", "text": "Over \ntime, I developed strategies like using breakpoints, console logs, and Chrome \nDevTools more effectively to isolate and resolve bugs. \n3. Time Management During Sprints \nIn the Agile setup, we worked with fixed sprint cycles. Meeting deadlines while \nmaintaining code quality was another challenge, especially when juggling between \ntraining modules and real-time development tasks. I learned to break down tasks into \nmanageable segments and prioritize issues based on urgency and impact. Jira and \ndaily stand-up meetings helped me stay aligned with team goals. \n4. Database and ORM Learning Curve \nWhile using MySQL was fairly straightforward, working with Prisma ORM \nintroduced a new abstraction layer I wasn’t familiar with. Understanding schema \ndefinitions, migrations, and query syntax in Prisma took time. I resolved this by \nstudying official documentation and experimenting with small queries before \napplying them to the main project. \n \n5. Communication and Collaboration \nAs a fresher, participating in discussions, asking questions, or reviewing code written \nby senior developers felt intimidating at first. Overcoming this hesitation was crucial. \nWith encouragement from my supervisor, I gradually became more confident in \nvoicing ideas, requesting feedback, and discussing blockers in meetings. This \nimproved both my communication skills and team integration. \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n30 \n \nCHAPTER 4: Contribution to the Organization \n \n \nDuring my internship at Xceedance, I contributed to the organization in several \nmeaningful ways, especially through active participation in both training assignments \nand real-time development tasks. Although I was in a learning phase, my ability to \napply new knowledge quickly allowed me to add value to the team and support \nongoing projects effectively. \n1."}, {"id": 87, "username": "oscar", "text": "Supporting In-House Development Projects \nAfter completing my initial training in Java Full Stack Development, I was assigned \nto work on internal tools and platforms built using the MERN stack (MongoDB, \nExpress.js, React.js, Node.js), though in our case, MySQL and Prisma ORM were \nused instead of MongoDB. I contributed by developing and maintaining UI \ncomponents using React.js, implementing forms, tables, modals, and integrating them \nwith backend APIs. \nThese contributions helped speed up feature development and reduced the workload \nfor senior developers. I ensured that the components I worked on were reusable, \nfollowed naming conventions, and aligned with the project's UI/UX standards. \n2. Writing and Testing APIs \nIn the backend, I helped write and test RESTful APIs using Node.js and Express. I \nworked on CRUD operations and participated in integrating user and data \nmanagement functionalities. I also created Postman collections for API testing, which \nassisted the QA team in verifying request-response behavior quickly. \n3. Code Quality and Best Practices \nUnder the guidance of my mentor, I began writing cleaner, modular code with proper \nerror handling and consistent formatting. I actively took part in code reviews, learned \nfrom feedback, and ensured that the code I pushed adhered to the team’s quality \nstandards. This not only improved the maintainability of the project but also \ndemonstrated my willingness to learn and grow professionally. \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n31 \n \n \n \n4. Collaboration and Initiative \nI maintained clear communication with my team using Slack and Microsoft Teams, \nregularly updating task progress on Jira, and joining all team stand-ups and sprint \nmeetings. I also proactively participated in knowledge-sharing sessions and team \ndiscussions, which helped improve the overall team dynamics. \nWhen I noticed repetitive code patterns in the frontend, I suggested and implemented \nreusable React components to improve code efficiency."}, {"id": 88, "username": "oscar", "text": "These small contributions \nmade a difference in reducing redundancy and improving UI consistency across the \napplication. \n \n \n \n \n \n \n \n \n \n \n \n \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n32 \n \nCHAPTER 5: Learning and Development \n \n \nMy internship at Xceedance was not only an introduction to the professional world \nbut also a period of intense personal and technical growth. I was exposed to \nindustry-standard tools, modern development practices, and a collaborative work \nenvironment that significantly enhanced both my technical competencies and soft \nskills. \n1. Technical Skills Gained \nOne of the most significant takeaways from my internship was the structured and \nin-depth technical training I received in the initial phase. The comprehensive Java \nFull Stack Development program spanned multiple technologies, including Angular \nfor building scalable front-end interfaces and Spring Boot for backend development. \nThrough hands-on projects and guided assignments, I developed the ability to build \nresponsive and dynamic UIs using Angular’s component-based architecture, two-way \ndata binding, routing modules, and service integration. I also gained experience in \nform validation, reactive forms, and API consumption using HttpClient. \nIn the backend, I acquired skills in setting up RESTful services with Spring Boot, \nworking with key concepts such as dependency injection, JPA repositories, custom \nexception handling, and layered architecture (Controller-Service-Repository). I also \nbecame familiar with securing APIs using Spring Security. \nBeyond the training, I transitioned to real-world development with a project that \nrequired working across a React-Node.js stack. On the frontend, I used React.js to \ncreate component-driven user interfaces, implemented global state management using \nContext API, and built reusable UI components. On the backend, I worked with \nNode.js and Express.js to create APIs, handle middleware logic, and interact with \ndatabases using Prisma ORM and MySQL."}, {"id": 89, "username": "oscar", "text": "\nAdditionally, I gained practical experience in: \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n33 \n \n●​ Postman for API testing and debugging.​\n \n●​ Git and GitHub for version control, managing pull requests, and \ncollaborating on code.​\n \n●​ Jira for Agile task tracking, sprint planning, and team collaboration.​\n \n●​ Apache Camel, an enterprise integration framework, where I learned about \nrouting rules, endpoints, and message transformations—vital in building \nscalable microservices.​\n \nThese skills allowed me to confidently contribute to the full lifecycle of web \napplication development, from UI creation to database operations. \n \n2. Software Development Practices \nThe internship provided a robust introduction to Agile software development. I was \nactively involved in daily stand-ups, sprint planning, and retrospectives, which \ndeepened my understanding of how teams manage workloads, prioritize features, and \niterate over deliverables. \nI followed best practices in software engineering, such as: \n●​ Writing clean, modular, and readable code.​\n \n●​ Using branching strategies (like feature branches) in Git.​\n \n●​ Performing code reviews and learning from feedback.​\n \n●​ Maintaining documentation to ensure codebase transparency.​\n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n34 \n \nI also gained insight into CI/CD pipelines and how teams deploy and monitor \napplications in production environments. \n \n3. Communication and Teamwork \nCollaboration was a core part of my internship. Working closely with experienced \ndevelopers, I learned the value of clear, concise communication—whether in \nmeetings, Slack discussions, or email updates. \nI gradually became more confident in: \n●​ Presenting my work during demos and review meetings.​\n \n●​ Raising blockers early and asking the right questions.​\n \n●​ Understanding the importance of giving and receiving constructive feedback.​\n \nI also contributed to project documentation, wrote detailed Jira updates, and helped \nonboard a new intern during the latter part of my internship."}, {"id": 90, "username": "oscar", "text": "These experiences \nimproved my written and verbal communication skills, preparing me for \nteam-oriented roles in the future. \n \n4. Problem-Solving and Adaptability \nEach task brought its own set of challenges—whether it was debugging legacy code, \nidentifying performance bottlenecks, or learning a new framework in a limited time. I \ndeveloped a systematic approach to solving problems: breaking them down into \nsmaller parts, researching effectively, testing iteratively, and seeking help when \nnecessary. \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n35 \n \nFor instance, during a bug-fix task involving React form state management, I had to \ntrace complex state transitions, isolate the issue, and refactor the code to ensure a \nseamless user experience—all within a sprint deadline. \nThese moments taught me to stay calm under pressure, adapt quickly, and \ncontinuously improve my learning process. \n \n5. Certifications and Additional Training \nAs part of the program, I received a certification upon completing the Java Full \nStack Development training, covering Java, Spring Boot, Angular, and MySQL. \nThis certification not only validated my learning but also added credibility to my \nprofessional skill set. \nAdditionally, I took initiative to complete internal learning modules and online \nresources shared by my mentor, particularly in React.js and backend optimization \ntechniques, which helped me go beyond the core training curriculum. \n \n \n \n \n \n \n \n \n \n \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n36 \n \nCHAPTER 6: Summary and Conclusion \n \n \n \n1. Overall Experience and Growth​\n My internship at Xceedance was a thoroughly enriching experience that played a \nsignificant role in shaping my technical skills, work ethic, and professional outlook. \nOver the course of the internship, which lasted from January to June 2025, I was not \nonly exposed to modern development technologies and frameworks but also \nimmersed in a professional ecosystem where collaboration, learning, and innovation \nwere part of the daily culture."}, {"id": 91, "username": "oscar", "text": "Being placed in the tech department, specifically in a \nfull-time, in-person role at the Noida office, allowed me to gain a realistic \nunderstanding of corporate expectations and industry standards. \nThe initial weeks of training in Java Full Stack Development served as a strong \ntechnical foundation. These sessions, led by experienced trainers and mentors, \ncovered Java, Spring Boot, Angular, database management, and software \ndevelopment best practices. I also appreciated that the company didn’t restrict us to \njust one stack. Through in-house projects, we explored technologies like React, \nNode.js, Express, Prisma, and MySQL, which gave me hands-on experience in \nbuilding full-stack applications from scratch. \n \n2. Integration into the Professional Environment​\nOne of the most impactful aspects of my internship was the chance to be integrated \ninto a live development team. I wasn’t assigned arbitrary or dummy \nprojects—instead, I was encouraged to contribute meaningfully to ongoing internal \ninitiatives. These contributions involved both frontend tasks such as building reusable \nUI components in React and backend work like designing and testing APIs in \nNode.js. \nDespite being a new entrant in the corporate world, I was treated with respect and \ngiven responsibilities that challenged me to grow. The company fostered an \nenvironment where asking questions was encouraged and support was always \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n37 \n \navailable. My mentor, Mr. Vihaan Mahato, played an instrumental role in guiding me \nthrough technical roadblocks and helping me adopt industry practices like clean code \nprinciples, structured debugging, and code reviews. \n \n3. Skill Development and Realizations​\nThroughout the internship, I developed a wide range of skills—technical, analytical, \nand interpersonal. I became proficient in tools like Git, Postman, and Jira, and grew \nmore comfortable working with RESTful APIs, relational databases, and frontend \nstate management."}, {"id": 92, "username": "oscar", "text": "I learned to deploy backend services and connect them with \nfrontend clients, allowing me to appreciate the end-to-end flow of full-stack web \napplications. \nOn the non-technical front, I improved my communication skills by participating in \ndaily team stand-ups, updating Jira tasks, writing documentation, and engaging in \ndiscussions with developers and QA professionals. I also learned time management by \nbalancing task deadlines with personal learning goals. Through real-world \nproblem-solving and debugging challenges, I built resilience and a solution-oriented \nmindset. \n4. Organizational Impact and Reflection​\nThough I joined as an intern, I made tangible contributions to the projects I worked \non. Whether by optimizing a form submission flow, resolving minor bugs, or helping \ndesign reusable components, I was able to leave a positive impact. These \ncontributions, though small in scope, helped the team accelerate delivery and allowed \nme to experience the fulfillment that comes from building functional, usable software. \nLooking back, I realize that this internship was more than just an opportunity to build \na resume—it was a critical phase of personal and professional transformation. It \nhelped me move from a theoretical understanding of software engineering to a \npractical, implementation-driven approach. It showed me how cross-functional teams \nwork in tandem, how to be accountable for deliverables, and how even interns can \nplay an active role in driving product value. \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n38 \n \n5. Conclusion​\nIn conclusion, my internship at Xceedance was an invaluable experience that \nsignificantly advanced my journey toward becoming a software developer. The \nbalance between training, mentorship, and real-time project work allowed me to not \nonly apply academic knowledge but also to acquire industry-ready skills. I now feel \nmore confident in tackling complex technical problems, contributing to team efforts, \nand continuously learning and evolving."}, {"id": 93, "username": "oscar", "text": "\nThe professional exposure, technical skills, and workplace relationships I built during \nthis period will remain a cornerstone of my early career. I am deeply grateful to \nXceedance for offering me this opportunity and would wholeheartedly recommend \nthe company to future interns looking for meaningful learning and impactful work \nexperience. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n39 \n \nCHAPTER 7: Suggestions for improvement \n \n \n \n1. Structured Feedback Mechanism​\nWhile my internship experience at Xceedance was overwhelmingly positive, one area \nthat could be enhanced is the implementation of a more structured and consistent \nfeedback mechanism. Although I did receive feedback informally during meetings \nand code reviews, a periodic one-on-one session with supervisors or HR to formally \ndiscuss strengths, areas of improvement, and long-term goals could help interns gain \ndeeper insights into their performance. Scheduled evaluations, such as monthly \nprogress reviews or goal-tracking sessions, would ensure that feedback is documented \nand actionable. This would also help interns stay aligned with expectations and \ncontinuously work toward their growth. \n \n2. Extended Exposure to Cross-Functional Teams​\nDuring the internship, most of our interactions were limited to the immediate \ntechnical team or mentor. While this setup was effective for daily task execution, \ninterns would benefit greatly from occasional interaction with other departments such \nas QA, DevOps, product management, and UI/UX design. These departments play \nintegral roles in product development, and exposure to their workflows would provide \ninterns with a broader understanding of how all teams contribute to delivering a final \nproduct. Organizing brief sessions or “job shadowing” opportunities with \nprofessionals from these areas could significantly expand interns' knowledge of \nend-to-end development processes. \n \n3. Gradual Integration Into Live Projects​\nOne challenge I faced during the transition from training to live projects was adapting \nquickly to unfamiliar codebases and team workflows."}, {"id": 94, "username": "oscar", "text": "While this is a common part of \nreal-world development, it could be mitigated by introducing a more gradual \nonboarding process to live projects. For instance, new interns could initially work on \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n40 \n \ninternal documentation, write test cases, or fix minor bugs to become familiar with the \ncode structure and logic before being assigned complex tasks. A well-structured \nhandover document for each project would also be helpful, outlining existing \nmodules, key files, and guidelines for setup and testing. \n \n4. More Hands-On Sessions During Training​\nThe training period was quite comprehensive, but a greater focus on practical \nassignments and mini-projects could make it even more effective. While we did have \nexercises after theoretical sessions, there were opportunities for deeper engagement \nthrough daily coding challenges, group-based mini-projects, or hackathons. This \nwould promote a more active learning environment and allow interns to consolidate \ntheir understanding before moving on to advanced topics. \n \n \n5. Enhanced Learning Resources​\nProviding centralized access to curated learning resources, such as internal \ndocumentation, recorded sessions, recommended reading, and tech-specific tutorials, \nwould support self-paced learning. Although we were guided well by mentors, having \nan internal portal or wiki where such material is organized and regularly updated \nwould be especially helpful when encountering new tools or frameworks during \nproject work. It would also reduce the time spent searching for solutions and increase \nproductivity. \n \n6. Post-Internship Career Guidance​\nLastly, incorporating a post-internship career guidance session would be a valuable \naddition to the program. Many interns are on the threshold of entering the professional \nworld and may benefit from mentorship on resume-building, interview preparation, \nspecialization choices (frontend, backend, DevOps, etc.), and long-term growth within \nthe tech industry."}, {"id": 95, "username": "oscar", "text": "A dedicated session or even a panel discussion with senior \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n41 \n \ndevelopers or alumni could inspire interns and help them make informed career \ndecisions. \n \n7. Conclusion​\nIn summary, Xceedance already offers a strong internship framework with meaningful \nresponsibilities, structured training, and mentorship. These suggestions aim to further \nelevate the experience by ensuring continuous improvement and holistic development. \nWith a few enhancements in feedback structure, interdepartmental exposure, project \nonboarding, and resource accessibility, the internship program can become even more \nimpactful for future batches. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n42 \n \nBibliography \n \n \n \n[1] Xceedance, “Xceedance – Insurance Technology Company,” Xceedance, \n[Online]. Available: https://www.xceedance.com. [Accessed: Apr. 29, 2025]. \n[2] \nLinkedIn, \n“Xceedance: \nOverview,” \nLinkedIn, \n[Online]. \nAvailable: \nhttps://www.linkedin.com/company/xceedance. [Accessed: Apr. 29, 2025]. \n[3] Pivotal Software, Inc., “Spring Boot Reference Documentation,” Spring.io, \n[Online]. \nAvailable: \nhttps://docs.spring.io/spring-boot/docs/current/reference/htmlsingle/. [Accessed: Apr. \n29, 2025]. \n[4] Angular Team, “Angular Documentation,” Angular.io, [Online]. Available: \nhttps://angular.io/docs. [Accessed: Apr. 29, 2025]. \n[5] Meta Platforms, Inc., “React – A JavaScript library for building user interfaces,” \nReactjs.org, \n[Online]. \nAvailable: \nhttps://reactjs.org/docs/getting-started.html. \n[Accessed: Apr. 29, 2025]. \n[6] OpenJS Foundation, “Node.js Documentation,” Nodejs.org, [Online]. Available: \nhttps://nodejs.org/en/docs. [Accessed: Apr. 29, 2025]. \n[7] Prisma Data, Inc., “Prisma Documentation,” Prisma.io, [Online]. Available: \nhttps://www.prisma.io/docs. [Accessed: Apr. 29, 2025]. \n[8] Oracle Corporation, “MySQL Documentation,” MySQL.com, [Online]. \nAvailable: https://dev.mysql.com/doc/. [Accessed: Apr. 29, 2025]. \n[9] Postman, Inc., “Postman Learning Center,” Postman.com, [Online]. Available: \nhttps://learning.postman.com. [Accessed: Apr. 29, 2025]. \n[10] Atlassian, “Jira Software Guides,” Atlassian.com, [Online]. Available: \nhttps://www.atlassian.com/software/jira/guides. [Accessed: Apr. 29, 2025]. \n \n \n \n \n \nDepartment of Electronics and Communications Engineering, BPIT​\n​\n​\n​\n43"}]